{
  "tutorial": "Osnove Git",
  "technical_concept": "Uvod v Git nadzor različic in preverjanje stanja repozitorija.",
  "challenge": {
    "task": "Preverite stanje vašega Git repozitorija, da vidite, kaj se sledi.",
    "hint": "Uporabite 'git status' za pregled trenutnega stanja vašega repozitorija."
  },
  "styles": {
    "detective_noir": {
      "title": "Primer nadzora različic",
      "dialogue": [
        {"character": "Detektiv Indecks", "line": "Delal sem na veliko primerih, ampak nič se ne primerja z iskanjem izgubljene kode. Misliš, da veš, kje je, pa puf — izginila je. Prepisana. Izgubljena za vedno."},
        {"character": "REDIS", "line": "Za to potrebuješ Git, detektiv. Sistem za nadzor različic. Sledi vsaki spremembi, vsaki vrstici, vsakemu premiku. Nič ni res izgubljeno."},
        {"character": "Detektiv Indecks", "line": "Kako začnem?"},
        {"character": "REDIS", "line": "Najprej preveri stanje z 'git status'. Pove ti, kje si — na kateri veji si, kaj se je spremenilo, kaj je pripravljeno. Kot tvoj dnevni pregled primera."},
        {"character": "Detektiv Indecks", "line": "Pregled stanja na kraju. Razumem. Kaj mi pokaže?"},
        {"character": "REDIS", "line": "Prikaže datoteke v treh stanjih: sledene in nespremenjene, spremenjene ampak ne pripravljene, in ne-sledene — popolnoma nove datoteke. Popoln pregled situacije."},
        {"character": "Detektiv Indecks", "line": "V redu, poglejmo, s čim imamo opravka."}
      ]
    },
    "sci_fi": {
      "title": "Inicializacija repozitorija",
      "dialogue": [
        {"character": "NEXUS", "line": "Inženir, sistem za nadzor različic je aktiven. Git shramba je inicializirana in pripravljena za operacije."},
        {"character": "Inženir", "line": "Moram preveriti trenutno stanje shrambe. Katere datoteke se sledijo?"},
        {"character": "NEXUS", "line": "Izvedite 'git status' za celovit pregled stanja. Prikaže trenutno vejo, pripravljene spremembe in ne-sledene datoteke."},
        {"character": "Inženir", "line": "Torej mi pove, kaj se je spremenilo od zadnjega zapisa?"},
        {"character": "NEXUS", "line": "Pravilno. Datoteke so razvrščene v tri kategorije: sledene/nespremenjene, spremenjene/ne-pripravljene in ne-sledene. Popoln pregled stanja sistema."},
        {"character": "Inženir", "line": "Izvedimo preverjanje stanja."},
        {"character": "NEXUS", "line": "Čakam na vaš ukaz, inženir."}
      ]
    }
  }
}
