{
  "tutorial": "Git Basics",
  "module": 1,
  "scene": 0,
  "technical_concept": "Introduction to Git version control and checking repository status.",
  "code_example": {
    "language": "git",
    "code": "git status"
  },
  "challenge": {
    "task": "Check the status of your Git repository to see what's being tracked.",
    "hint": "Use 'git status' to see the current state of your repository.",
    "check_logic": {
      "validation_command": "git status",
      "expected_result": {
        "type": "user_output_contains",
        "value": "On branch"
      }
    }
  },
  "styles": [
    {
      "name": "detective_noir",
      "title": "The Version Control Case",
      "dialogue": [
        {
          "character": "Detective Indecks",
          "line": "I've worked a lot of cases, but nothing compares to tracking down lost code. You think you know where something is, then poof—it's gone. Overwritten. Lost to time."
        },
        {
          "character": "Git",
          "line": "That's where I come in, Detective. The name's Git. I'm a version control system—think of me as your evidence locker. Every change you make, every file you modify, I keep a record."
        },
        {
          "character": "Detective Indecks",
          "line": "An evidence locker for code. I like it. But how do I know what's in the locker?"
        },
        {
          "character": "Git",
          "line": "Simple. You ask me for a status report. Run 'git status' and I'll tell you everything—what files are tracked, what's been modified, what's waiting to be committed to the permanent record."
        },
        {
          "character": "Detective Indecks",
          "line": "So it's like checking my case board. Seeing what evidence is tagged and what's still loose."
        },
        {
          "character": "Git",
          "line": "Exactly. It's your first move in any investigation—get your bearings. Know what you're working with."
        },
        {
          "character": "Detective Indecks",
          "line": "Alright, Git. Let's see what this repository looks like. Show me the status."
        }
      ]
    },
    {
      "name": "sci_fi",
      "title": "Repository Initialization",
      "dialogue": [
        {
          "character": "Engineer",
          "line": "NEXUS, I need a system to track changes to our codebase. Something that won't lose our work if systems fail."
        },
        {
          "character": "Git Protocol",
          "line": "Greetings, Engineer. I am the Git Protocol—a distributed version control system. I maintain a complete history of all code modifications across time."
        },
        {
          "character": "Engineer",
          "line": "How do I know what state the repository is in?"
        },
        {
          "character": "Git Protocol",
          "line": "Issue a 'git status' command. This diagnostic will report: current branch, tracked files, modifications, and items pending commitment to the permanent timeline."
        },
        {
          "character": "NEXUS",
          "line": "Think of it as a scanning protocol, Engineer. Git status provides a real-time snapshot of your repository's state—like checking life support systems before a spacewalk."
        },
        {
          "character": "Engineer",
          "line": "So every change is tracked and recoverable?"
        },
        {
          "character": "Git Protocol",
          "line": "Affirmative. Nothing is truly lost. Every committed change is preserved in the repository's history, accessible across all timelines."
        },
        {
          "character": "Engineer",
          "line": "Excellent. Let me run this status diagnostic."
        }
      ]
    },
    {
      "name": "shakespearean",
      "title": "The Chronicle of Changes",
      "dialogue": [
        {
          "character": "Lord Cachington",
          "line": "My code doth vanish like ghosts in the night! One moment 'tis present, the next—erased by mine own careless hand!"
        },
        {
          "character": "Git",
          "line": "Despair not, noble lord! I am Git, keeper of histories, guardian of versions. Every alteration thou makest shall be recorded in mine chronicles."
        },
        {
          "character": "Lord Cachington",
          "line": "A chronicle of my work? Pray tell, how might I consult this record?"
        },
        {
          "character": "Git",
          "line": "Speak unto me the words 'git status', and I shall reveal the current state of thy repository—what files are watched, what changes await inscription, what stands ready for eternal preservation!"
        },
        {
          "character": "Lord Cachington",
          "line": "'Tis like consulting the royal ledger! To see what evidence hath been gathered and what yet remains unbound!"
        },
        {
          "character": "Git",
          "line": "Precisely, my liege! 'Tis thy first action in any endeavor—to survey the landscape, to know thy standing before thou proceedest!"
        },
        {
          "character": "Lord Cachington",
          "line": "Then let us consult this status most informative! Show me the state of mine repository!"
        }
      ]
    },
    {
      "name": "office_comedy",
      "title": "Version Control Onboarding",
      "dialogue": [
        {
          "character": "Dave (IT Manager)",
          "line": "So, you've probably heard horror stories about people losing code. Kevin once deleted an entire feature because he forgot to save. That was a fun Monday."
        },
        {
          "character": "New Hire",
          "line": "How do I avoid becoming a cautionary tale?"
        },
        {
          "character": "Git",
          "line": "That's what I'm here for. I'm Git, your version control system. Think of me as a time machine for code. Every change you make, I can remember it—forever."
        },
        {
          "character": "Dave (IT Manager)",
          "line": "It's like having infinite undo, except actually reliable. Unlike the undo button in Excel, which I'm convinced is just there for decoration."
        },
        {
          "character": "New Hire",
          "line": "So how do I know what's being tracked?"
        },
        {
          "character": "Git",
          "line": "Run 'git status'. I'll tell you everything—what files I'm watching, what's changed, what's staged for the next save. It's like checking your to-do list, but less depressing."
        },
        {
          "character": "Dave (IT Manager)",
          "line": "Always run git status before you do anything else. It's like looking both ways before crossing the street, except the street is your codebase and the cars are merge conflicts."
        },
        {
          "character": "New Hire",
          "line": "Alright, let me try this status command."
        }
      ]
    }
  ]
}
