{
  "tutorial": "Git Basics",
  "module": 1,
  "scene": 1,
  "technical_concept": "Staging files with 'git add' to prepare them for commit.",
  "code_example": {
    "language": "git",
    "code": "echo 'evidence' > clue.txt\ngit add clue.txt"
  },
  "challenge": {
    "task": "Create a new file called 'evidence.txt' and stage it for commit using git add.",
    "hint": "First create the file, then use git add to stage it.",
    "check_logic": {
      "setup_commands": [
        "git config user.email 'test@test.com'",
        "git config user.name 'Test'"
      ],
      "validation_command": "git status",
      "expected_result": {
        "type": "user_output_contains",
        "value": "evidence.txt"
      }
    },
    "solution": "touch evidence.txt && git add evidence.txt"
  },
  "styles": [
    {
      "name": "detective_noir",
      "title": "Staging the Evidence",
      "dialogue": [
        {
          "character": "Detective Indecks",
          "line": "I've got a new piece of evidence—a file that could crack this case wide open. But I can't just toss it in the evidence locker. There's procedure."
        },
        {
          "character": "Git",
          "line": "That's right, Detective. Before anything goes into permanent storage, it needs to be staged. Think of staging as the evidence intake desk—you mark what's ready to be filed officially."
        },
        {
          "character": "Detective Indecks",
          "line": "So I can't just commit files directly?"
        },
        {
          "character": "Git",
          "line": "Not without staging them first. It's a two-step process: stage with 'git add', then commit. This way you control exactly what gets recorded—no accidents, no surprises."
        },
        {
          "character": "Detective Indecks",
          "line": "Makes sense. I don't want to accidentally file my lunch order as evidence."
        },
        {
          "character": "Git",
          "line": "Precisely. Say you've got a file called 'evidence.txt'. You run 'git add evidence.txt', and I'll move it to the staging area. When you're ready, you commit everything that's staged—all at once, nice and clean."
        },
        {
          "character": "Detective Indecks",
          "line": "What if I stage something by mistake?"
        },
        {
          "character": "Git",
          "line": "'git reset' pulls it back out of staging. Nothing's permanent until you commit. The staging area is like a holding cell—you can always let someone go if new information comes to light."
        },
        {
          "character": "Detective Indecks",
          "line": "Alright. Let me create evidence.txt and stage it properly."
        }
      ]
    },
    {
      "name": "sci_fi",
      "title": "Staging Protocol",
      "dialogue": [
        {
          "character": "Engineer",
          "line": "I've modified several systems files. How do I prepare them for permanent storage?"
        },
        {
          "character": "Git Protocol",
          "line": "You must first stage your changes. Staging is a buffer zone—a preparation area where you select which modifications to include in the next commit."
        },
        {
          "character": "NEXUS",
          "line": "Think of it as a pre-flight checklist, Engineer. You don't launch everything into the permanent timeline at once. You review, you stage, then you commit."
        },
        {
          "character": "Engineer",
          "line": "Why not commit directly?"
        },
        {
          "character": "Git Protocol",
          "line": "Precision. You may have modified ten files, but only want to commit three. Staging lets you choose. Use 'git add filename' to stage individual files. Use 'git add .' to stage all changes."
        },
        {
          "character": "NEXUS",
          "line": "It's like packing cargo for transport. You don't beam everything in the room—you select what goes in the cargo bay first."
        },
        {
          "character": "Engineer",
          "line": "Can I unstage something if I change my mind?"
        },
        {
          "character": "Git Protocol",
          "line": "Affirmative. 'git reset filename' removes it from staging. Nothing is final until commit."
        },
        {
          "character": "Engineer",
          "line": "Understood. Let me create evidence.txt and stage it."
        }
      ]
    },
    {
      "name": "shakespearean",
      "title": "The Preparation of Records",
      "dialogue": [
        {
          "character": "Lord Cachington",
          "line": "I have penned a most important document—'evidence.txt'—and wish to preserve it in thy chronicles! Make it so!"
        },
        {
          "character": "Git",
          "line": "Patience, my lord! Before any document enters the eternal archive, it must first pass through the staging chamber—a place of preparation and review!"
        },
        {
          "character": "Lord Cachington",
          "line": "Staging? Canst thou not simply record it forthwith?"
        },
        {
          "character": "Git",
          "line": "Nay! 'Tis a matter of precision, sire! Thou may have altered ten scrolls, yet wish to preserve but three. The staging area lets thee choose which changes are worthy of the permanent record!"
        },
        {
          "character": "Lord Cachington",
          "line": "Ah! Like selecting which declarations shall be sealed with the royal wax, and which remain mere drafts!"
        },
        {
          "character": "Git",
          "line": "Exactly so, my liege! Use 'git add evidence.txt' to place thy file upon the staging table. Then, when satisfied, thou shalt commit all staged items to the chronicle with a single decree!"
        },
        {
          "character": "Lord Cachington",
          "line": "And if I stage something in error?"
        },
        {
          "character": "Git",
          "line": "'git reset' removes it from the staging table! Nothing is bound until the commit is spoken!"
        },
        {
          "character": "Lord Cachington",
          "line": "Then let me inscribe evidence.txt and place it upon thy staging table!"
        }
      ]
    },
    {
      "name": "office_comedy",
      "title": "The Staging Area Concept",
      "dialogue": [
        {
          "character": "New Hire",
          "line": "I created a new file called evidence.txt. How do I save it to Git?"
        },
        {
          "character": "Dave (IT Manager)",
          "line": "You don't 'save' to Git. You stage, then commit. It's a two-step process, like saving a Word document except somehow more complicated and less intuitive."
        },
        {
          "character": "Git",
          "line": "It's actually quite logical. The staging area is like a shopping cart. You add items to your cart with 'git add', review what's in there, then checkout—I mean, commit."
        },
        {
          "character": "New Hire",
          "line": "Why can't I just commit directly?"
        },
        {
          "character": "Dave (IT Manager)",
          "line": "Because sometimes you've changed 15 files but only want to commit 3 of them. Staging lets you pick and choose. It's like meal prep—you don't just throw everything in the fridge at once."
        },
        {
          "character": "Git",
          "line": "Run 'git add evidence.txt' to stage your file. Then 'git status' will show it's ready to commit. If you stage something by mistake, 'git reset evidence.txt' removes it from staging."
        },
        {
          "character": "New Hire",
          "line": "So staging is like a waiting room before things get permanently saved?"
        },
        {
          "character": "Dave (IT Manager)",
          "line": "Exactly. It's where your changes sit while you decide if you really want to commit to them. Which is more commitment than Kevin's ever shown to anything."
        },
        {
          "character": "New Hire",
          "line": "Got it. Let me create evidence.txt and stage it."
        }
      ]
    }
  ]
}