{
  "tutorial": "Git Basics",
  "module": 1,
  "scene": 2,
  "technical_concept": "Creating commits with 'git commit' to save a snapshot of staged changes to the repository history.",
  "code_example": {
    "language": "git",
    "code": "git commit -m \"Add new evidence file\""
  },
  "challenge": {
    "task": "Create a file called 'report.txt', stage it, and commit it with the message 'Initial report'.",
    "hint": "Stage your changes first, then commit with a descriptive message.",
    "check_logic": {
      "setup_commands": [
        "git config user.email 'test@test.com'",
        "git config user.name 'Test'"
      ],
      "validation_command": "git log --oneline",
      "expected_result": {
        "type": "user_output_contains",
        "value": "Initial report"
      }
    },
    "solution": "touch report.txt && git add report.txt && git commit -m \"Initial report\""
  },
  "styles": [
    {
      "name": "detective_noir",
      "title": "Closing the Case File",
      "dialogue": [
        {
          "character": "Detective Indecks",
          "line": "I've got evidence staged and ready. But it's not official until I seal the case file. How do I make it permanent?"
        },
        {
          "character": "Git",
          "line": "That's where commits come in, Detective. A commit is like closing a case file and stamping it with a date and summary. Everything staged gets locked into the permanent record—forever."
        },
        {
          "character": "Detective Indecks",
          "line": "So once I commit, it can't be changed?"
        },
        {
          "character": "Git",
          "line": "That's the idea. Every commit gets a unique ID, a timestamp, and a message explaining what changed. Use 'git commit -m \"Your message here\"' to create a commit with a description."
        },
        {
          "character": "Detective Indecks",
          "line": "The message is important, I'm guessing?"
        },
        {
          "character": "Git",
          "line": "Critical. Think of it like writing a case summary. 'Fixed bug' is vague—useless six months from now. 'Fixed login timeout issue affecting mobile users' tells the whole story. Future you will thank present you."
        },
        {
          "character": "Detective Indecks",
          "line": "What if I need to see all my commits later?"
        },
        {
          "character": "Git",
          "line": "'git log' shows your entire commit history—every case you've closed, in order. It's your permanent record, your paper trail, your proof that you did the work."
        },
        {
          "character": "Detective Indecks",
          "line": "Alright. Let me create report.txt, stage it, and commit it with a proper message."
        }
      ]
    },
    {
      "name": "sci_fi",
      "title": "Commit to Timeline",
      "dialogue": [
        {
          "character": "Engineer",
          "line": "My changes are staged. How do I save them permanently to the repository timeline?"
        },
        {
          "character": "Git Protocol",
          "line": "You must create a commit. A commit is a snapshot—a frozen moment in your codebase's history, immutable and timestamped."
        },
        {
          "character": "NEXUS",
          "line": "Think of it as creating a save point in time, Engineer. Everything in your staging area becomes part of the permanent historical record."
        },
        {
          "character": "Engineer",
          "line": "How do I create this snapshot?"
        },
        {
          "character": "Git Protocol",
          "line": "Use 'git commit -m \"message\"'. The -m flag provides a commit message—a mandatory description of what changed. This message becomes part of the permanent record."
        },
        {
          "character": "NEXUS",
          "line": "Commit messages should be descriptive. 'Fixed issue' is insufficient. 'Resolved oxygen regulator calibration error in sector 7' provides context for future engineers."
        },
        {
          "character": "Engineer",
          "line": "Can I review my commit history?"
        },
        {
          "character": "Git Protocol",
          "line": "Affirmative. 'git log' displays the complete timeline—every commit, message, author, and timestamp. Your permanent operational record."
        },
        {
          "character": "Engineer",
          "line": "Understood. Creating report.txt, staging it, and committing to timeline."
        }
      ]
    },
    {
      "name": "shakespearean",
      "title": "The Eternal Inscription",
      "dialogue": [
        {
          "character": "Lord Cachington",
          "line": "My documents are staged upon thy table! Now I command thee—seal them in thy eternal chronicles!"
        },
        {
          "character": "Git",
          "line": "So shall it be, my lord! With 'git commit', I shall inscribe thy changes into the permanent annals! But first—thou must provide a message, a declaration of what thou hast wrought!"
        },
        {
          "character": "Lord Cachington",
          "line": "A message? What manner of inscription dost thou require?"
        },
        {
          "character": "Git",
          "line": "A summary, sire! Use 'git commit -m \"thy message here\"'. This declaration shall accompany thy commit throughout eternity. Future scholars will read it and understand thy intent!"
        },
        {
          "character": "Lord Cachington",
          "line": "Should I write 'fixed stuff' and be done with it?"
        },
        {
          "character": "Git",
          "line": "Nay, my lord! Such vagueness dishonors the archive! Write instead: 'Resolved the authentication scroll corruption in the eastern provinces.' Be specific! Be descriptive! The future depends upon thy clarity!"
        },
        {
          "character": "Lord Cachington",
          "line": "Can I consult past commits, to see what I inscribed before?"
        },
        {
          "character": "Git",
          "line": "'git log' reveals all! Every commit, every message, every author—the complete history laid bare like an illuminated manuscript!"
        },
        {
          "character": "Lord Cachington",
          "line": "Then let me create report.txt, stage it, and commit it with a message most eloquent!"
        }
      ]
    },
    {
      "name": "office_comedy",
      "title": "The Commitment Issues",
      "dialogue": [
        {
          "character": "New Hire",
          "line": "My file is staged. Now what?"
        },
        {
          "character": "Dave (IT Manager)",
          "line": "Now you commit. That's when your changes actually get saved to Git's permanent history. It's called a 'commit' because unlike Kevin, Git actually follows through."
        },
        {
          "character": "Git",
          "line": "Use 'git commit -m \"Your message\"'. The -m flag lets you add a message describing what you changed. And please, make it useful."
        },
        {
          "character": "New Hire",
          "line": "What counts as useful?"
        },
        {
          "character": "Dave (IT Manager)",
          "line": "Not 'stuff', not 'changes', not 'fixed it'. Tell me what you actually did. 'Added user authentication' is good. 'did some work' is how Kevin does it."
        },
        {
          "character": "Git",
          "line": "Your commit message is documentation. Six months from now, when something breaks, you'll be reading through commit history trying to figure out what changed. Help your future self out."
        },
        {
          "character": "New Hire",
          "line": "Can I see my old commits?"
        },
        {
          "character": "Dave (IT Manager)",
          "line": "'git log' shows everything. Every commit, every message, every mistake Kevin made. It's like a diary, except it actually happened and you can't delete it."
        },
        {
          "character": "New Hire",
          "line": "Got it. Let me create report.txt, stage it, and commit it with a real message."
        }
      ]
    }
  ]
}