{
  "tutorial": "Основе Docker",
  "technical_concept": "Docker је алат који пакује апликације у контејнере — лака, преносива окружења која раде исто свуда.",
  "challenge": {
    "task": "Проверите да је Docker инсталиран покретањем команде за верзију.",
    "hint": "Укуцајте 'docker --version' да видите инсталирану верзију Dockera."
  },
  "styles": {
    "fairy_tale": {
      "title": "Чаробњакова контејнерска чаролија",
      "dialogue": [
        {"character": "Стари чаробњак Докерус", "line": "Дођи, млади шегрте. Седи поред ватре. Данас ћу те научити најмоћнију чаролију у целом краљевству: контејнеризацију!"},
        {"character": "Шегрт", "line": "Контејнеризација? То звучи... компликовано, мајсторе."},
        {"character": "Стари чаробњак Докерус", "line": "Уопште не! Размисли овако. Кад пекар жели да подели рецепт, не шаље целу кухињу. Уместо тога напише рецепт који свако може да прати — у било којој кухињи."},
        {"character": "Шегрт", "line": "Значи Docker је као... чаробна књига рецепата?"},
        {"character": "Стари чаробњак Докерус", "line": "Тачно! Три корака, дете. Прво напишеш Чаробни свитак — то је твој Dockerfile. Затим од њега направиш Артефакт — то је твоја слика. И коначно, из артефакта призовеш Биће — то је твој контејнер."}
      ]
    },
    "flirting": {
      "title": "Свајп удесно за контејнере",
      "dialogue": [
        {"character": "Docker", "line": "Хеј, ти. Да, ти — који покрећеш 'Ради на мом рачунару' већ трећи пут ове недеље. Време да попричамо."},
        {"character": "Ти", "line": "Docker? Чула сам о теби. Сви кажу да си одличан."},
        {"character": "Docker", "line": "Прилично сам добар, да. Помажем ти да спакујеш своју апликацију тако да ради свуда — на твом лаптопу, у облаку, на Пају, било где."},
        {"character": "Ти", "line": "Значи ти си као... путна торба за код?"},
        {"character": "Docker", "line": "Свиђа ми се та аналогија. Само провери да сам инсталиран, па идемо даље. Укуцаш 'docker --version' и ако одговорим, званично смо пар."}
      ]
    }
  }
}
