{
  "tutorial": "Основе Docker",
  "technical_concept": "Команда 'docker run' креира и покреће контејнер из слике. Ако слика није локално доступна, Docker је аутоматски преузима из Docker Hub-а.",
  "challenge": {
    "task": "Покрените класични 'hello-world' контејнер да верификујете да Docker ради од краја до краја.",
    "hint": "Укуцајте 'docker run hello-world' — Docker ће преузети слику и покренути је."
  },
  "styles": {
    "fairy_tale": {
      "title": "Призивање првог бића",
      "dialogue": [
        {"character": "Стари чаробњак Докерус", "line": "Сад кад знамо да наши алати раде, време је да призовеш своје прво биће! Чаролија је 'docker run'."},
        {"character": "Шегрт", "line": "Које биће да призовем, мајсторе?"},
        {"character": "Стари чаробњак Докерус", "line": "Почни са најједноставнијим — 'hello-world'. То је мали пријатељски дух који се појави, донесе поруку и нестане."},
        {"character": "Шегрт", "line": "А шта ако немам нацрт за то биће?"},
        {"character": "Стари чаробњак Докерус", "line": "У томе је лепота! Docker ће одлетети у Велику библиотеку — зове се Docker Hub — и донети нацрт за тебе. Без напора!"},
        {"character": "Шегрт", "line": "Значи могу да призовем цео веб сервер а да га сам не градим?"},
        {"character": "Стари чаробњак Докерус", "line": "Наравно! 'docker run nginx' ти даје веб сервер. 'docker run postgres' ти даје базу података. Цео свет бића ти је на располагању!"}
      ]
    },
    "flirting": {
      "title": "Први састанак",
      "dialogue": [
        {"character": "Docker", "line": "Значи... спреман за наш први прави састанак? Имам нешто посебно спремно. Укуцај 'docker run hello-world'."},
        {"character": "Ти", "line": "Шта је hello-world? За први састанак звучи прилично основно."},
        {"character": "Docker", "line": "Веруј ми. То је класика. Брзо, једноставно и каже ти да између нас све ради. Као прва кафица."},
        {"character": "Ти", "line": "А ако немам ту hello-world ствар?"},
        {"character": "Docker", "line": "Без бриге, донећу је за тебе. Знам једно место — Docker Hub. Као продавница апликација, само за контејнере."},
        {"character": "Ти", "line": "Значи кажеш ми да добијам потпуно функционалну базу података једном командом?"},
        {"character": "Docker", "line": "Сад схваташ. Али не журимо. Прво први састанак. Покрени hello-world за мене."}
      ]
    }
  }
}
