{
  "tutorial": "Основе Docker",
  "technical_concept": "У лекцији 02 написали смо FROM, RUN, CMD — али како ваш код улази У слику? То је COPY. А где иде? То је WORKDIR. И како свет зна где да вас нађе? То је EXPOSE.",
  "challenge": {
    "task": "Напишите Dockerfile за нашу Јава апликацију: почните FROM eclipse-temurin:21, поставите WORKDIR на /app, COPY App.java у контејнер, RUN javac за компајлирање, EXPOSE порт 8080 и CMD за покретање.",
    "hint": "Шест линија: FROM, WORKDIR, COPY, RUN, EXPOSE, CMD. Користите 'COPY App.java .' (са тачком!) за копирање у WORKDIR."
  },
  "styles": {
    "fairy_tale": {
      "title": "Уметност слојевитих чаролија",
      "dialogue": [
        {"character": "Стари чаробњак Докерус", "line": "Твој први чаробни свитак је био једноставан али моћан. Сад ћу те научити напредну уметност — слојевите чаролије!"},
        {"character": "Шегрт", "line": "Слојевите чаролије? Звучи компликовано."},
        {"character": "Стари чаробњак Докерус", "line": "Замисли да градиш кулу. Свака инструкција додаје спрат. WORKDIR одређује у којој соби радиш. COPY доноси твоје чаробне састојке унутра."},
        {"character": "Шегрт", "line": "А EXPOSE?"},
        {"character": "Стари чаробњак Докерус", "line": "EXPOSE отвара прозор на твојој кули — каже свету 'моје биће слуша овде на овом порту'. Не отвара стварно, само документује намеру."},
        {"character": "Шегрт", "line": "Али мајсторе — у претходној лекцији написали смо FROM и RUN и CMD... али никад нисмо стварно ставили свој код у контејнер!"},
        {"character": "Стари чаробњак Докерус", "line": "Одлично питање! Тачно то ради COPY. 'COPY App.java .' узима твој свитак из спољашњег света и ставља га у WORKDIR контејнера."},
        {"character": "Шегрт", "line": "Значи комплетан рецепт је: изабери темељ, постави собу, копирај изворни код, компајлирај и отвори прозор?"},
        {"character": "Стари чаробњак Докерус", "line": "Тачно! И ево тајне — свака инструкција креира чаробни слој који Docker памти. Ако се слој не промени, прескаче га!"}
      ]
    },
    "flirting": {
      "title": "Боље упознавање",
      "dialogue": [
        {"character": "Docker", "line": "Наш први Dockerfile је био леп, али хајде да идемо дубље. Време да изградимо нешто право заједно."},
        {"character": "Ти", "line": "Спреман сам. Шта је ново?"},
        {"character": "Docker", "line": "WORKDIR — то је избор нашег стана. 'WORKDIR /app' каже 'овде сад живимо.' Све после тога се дешава у том директоријуму."},
        {"character": "Ти", "line": "А COPY?"},
        {"character": "Docker", "line": "COPY је сељење твојих ствари. Сећаш се наше Јава апликације? 'COPY App.java .' доноси твој изворни код у стан."},
        {"character": "Ти", "line": "А EXPOSE?"},
        {"character": "Docker", "line": "То је дељење наше адресе. 'EXPOSE 8080' — 'доступни смо на порту 8080.' Отворена врата за посетиоце."},
        {"character": "Ти", "line": "Значи цела слика је: изабери основу, постави стан, пресели код, компајлирај, отвори врата и покрени?"},
        {"character": "Docker", "line": "Погледај те како све склапаш! И ево професионалног савета — свака инструкција је слој који Docker кешира. Стабилне ствари прво!"}
      ]
    }
  }
}
