{
  "tutorial": "Основе Docker",
  "technical_concept": "Контејнери су пролазни — кад се зауставе, њихови подаци су изгубљени. Волумени (-v) чувају податке ван контејнера. Мапирање портова (-p) излаже сервисе хосту.",
  "challenge": {
    "task": "Покрените nginx контејнер у одвојеном режиму (-d) са мапирањем порта 8080 на порт контејнера 80.",
    "hint": "Користите 'docker run -d -p 8080:80 nginx' — заставица -d га покреће у позадини."
  },
  "styles": {
    "fairy_tale": {
      "title": "Ковчези са благом и прозори куле",
      "dialogue": [
        {"character": "Стари чаробњак Докерус", "line": "Нешто мораш да разумеш, шегрте. Кад призвано биће нестане, нестане СВЕ у њему. Сваки податак, сваки фајл — пуф!"},
        {"character": "Шегрт", "line": "Све? Сви подаци? То је ужасно!"},
        {"character": "Стари чаробњак Докерус", "line": "Заиста — осим ако му даш Ковчег са благом! Волумен је чаробни ковчег који постоји ван бића. '-v db2data:/database' значи 'причврсти ковчег зван db2data на бићев /database директоријум'."},
        {"character": "Шегрт", "line": "Значи следеће биће може да отвори исти ковчег и нађе све записе базе података?"},
        {"character": "Стари чаробњак Докерус", "line": "Тачно! А онда су ту Прозори куле — мапирање портова! '-p 8080:80' значи 'изгради мост од твојих дворских врата 8080 до бићевог прозора 80'."},
        {"character": "Шегрт", "line": "Мост из мог света у бићев свет?"},
        {"character": "Стари чаробњак Докерус", "line": "Да! Сад призови nginx биће са мостом — одвојено, да ради у позадини док ти настављаш учење."},
        {"character": "Шегрт", "line": "Ковчези за податке, мостови за везе. Обожавам ову магију!"}
      ]
    },
    "flirting": {
      "title": "Заједнички живот",
      "dialogue": [
        {"character": "Docker", "line": "Океј, важан разговор о вези. Контејнери су... привремени. Кад се зауставе, све унутра нестане."},
        {"character": "Ти", "line": "Значи сваки пут кад рестартујем, сви моји подаци нестану? То је разлог за раскид."},
        {"character": "Docker", "line": "Зато имамо волумене! Замисли то као заједнички складишни простор. '-v db2data:/database' значи 'чувамо податке заједно, чак и кад мене нема код куће'."},
        {"character": "Ти", "line": "Океј, то је заправо лепо. А шта са портовима?"},
        {"character": "Docker", "line": "Портови су начин на који пуштамо спољашњи свет унутра. '-p 8080:80' значи 'мој стан има врата 80, али посетиоци долазе кроз 8080'."},
        {"character": "Ти", "line": "Значи могу да покренем веб сервер и стварно га посетим у претраживачу?"},
        {"character": "Docker", "line": "Тачно! localhost:8080 и бум — повезан си. Заставица -d значи да радим тихо у позадини."},
        {"character": "Ти", "line": "У реду, хајде да пробамо. Nginx, одвојено, мапирање портова."}
      ]
    }
  }
}
