{
  "tutorial": "Основе Docker",
  "technical_concept": "Docker Compose вам омогућава дефинисање и покретање вишеконтејнерских апликација у једном YAML фајлу. Уместо покретања више 'docker run' команди, опишете све у docker-compose.yml.",
  "challenge": {
    "task": "Напишите docker-compose.yml са два сервиса: 'web' користећи nginx слику са мапирањем порта 8080:80 и 'db' користећи ibmcom/db2 слику.",
    "hint": "Почните са 'services:', затим дефинишите 'web' и 'db' као под-кључеве. Сваки треба 'image:'. Web треба 'ports:'."
  },
  "styles": {
    "fairy_tale": {
      "title": "Састављање дружине бића",
      "dialogue": [
        {"character": "Стари чаробњак Докерус", "line": "Научили сте да призивате појединачна бића. Али праве авантуре захтевају ДРУЖИНУ — више бића која раде заједно!"},
        {"character": "Шегрт", "line": "Као биће веб сервера и биће DB2 базе података који се боре раме уз раме?"},
        {"character": "Стари чаробњак Докерус", "line": "Тачно! Али призивање једног по једног је досадно и склоно грешкама. Зато су древни чаробњаци створили 'docker-compose.yml' — Велики свитак."},
        {"character": "Шегрт", "line": "Један свитак да их све призове?"},
        {"character": "Стари чаробњак Докерус", "line": "Заиста! У овом свитку свако биће је 'сервис' са својим одељком. Одредите слику, портове, волумене — све."},
        {"character": "Шегрт", "line": "И могу да причају међусобно?"},
        {"character": "Стари чаробњак Докерус", "line": "Да! Docker Compose креира чаробну мрежу где се бића налазе по имену. 'docker compose up' и сва бића се буде истовремено!"},
        {"character": "Шегрт", "line": "Тако раде праве апликације у стварном свету, зар не?"},
        {"character": "Стари чаробњак Докерус", "line": "Наравно. Свака пословна апликација — веб сервер, DB2 база, можда кеш — све заједно у једном свитку."}
      ]
    },
    "flirting": {
      "title": "Заједнички живот (стварно)",
      "dialogue": [
        {"character": "Docker", "line": "Значи виђамо се већ неко време. Појединачни контејнери, мапирање портова, волумени. Време за следећи корак — заједнички живот."},
        {"character": "Ти", "line": "Мислиш... Docker Compose?"},
        {"character": "Docker", "line": "Читаш унапред! Да. Docker Compose је кад више контејнера дели заједнички живот у једном YAML фајлу."},
        {"character": "Ти", "line": "Као веб сервер и DB2 база који деле стан?"},
        {"character": "Docker", "line": "Тачно. Веб сервер управља улазним вратима (портови), DB2 чува све податке (волумени) и аутоматски се налазе преко мреже."},
        {"character": "Ти", "line": "То је... заправо слатко. Имају своју малу мрежу међу собом?"},
        {"character": "Docker", "line": "Compose је креира аутоматски. Без непријатног упознавања. И најбољи део? 'docker compose up' — једна команда за све."},
        {"character": "Ти", "line": "Једна команда за све. Убеђен сам."},
        {"character": "Docker", "line": "Онда напиши наше прво заједничко домаћинство. Веб сервер и DB2 база. Наш мали дигитални дом."}
      ]
    }
  }
}
