{
  "tutorial": "Основе Bash",
  "technical_concept": "Терминал је ваш прозор у систем датотека. 'pwd' показује где сте (Print Working Directory). 'ls' исписује датотеке и фасцикле на тренутној локацији — додајте '-la' за скривене датотеке и детаље. 'cd' мења директоријум — 'cd ..' иде један ниво горе, 'cd ~' иде кући. 'mkdir' прави нове директоријуме.",
  "challenge": {
    "task": "Направите директоријум под именом 'camp'.",
    "hint": "Која команда прави нови директоријум?"
  },
  "styles": {
    "survival": {
      "title": "Буђење у дивљини",
      "dialogue": [
        {"character": "Приповедач", "line": "Отворите очи. Изнад вас се уздижу борови. Ваздух мирише на кишу и земљу. Ваш ранац је нестао, телефон је мртав — али на стени поред вас блиста терминал."},
        {"character": "Терминал", "line": "СИСТЕМ АКТИВАН. Добродошли, преживели. Ја сам ваша једина веза са спољашњим светом. Кроз мене можете да навигирате, градите и преживите."},
        {"character": "Ви", "line": "Где... где сам?"},
        {"character": "Терминал", "line": "Укуцајте 'pwd' — Print Working Directory. Рећи ће вам тачно где сте у овој дивљини."},
        {"character": "Ви", "line": "У реду... /дивљина/пропланак. То... није баш охрабрујуће."},
        {"character": "Терминал", "line": "Сада укуцајте 'ls' да се осврнете. Исписује све на вашој тренутној локацији — датотеке, директоријуме, ресурсе. Додајте '-la' за скривене ствари и детаље. Знање је преживљавање."},
        {"character": "Ви", "line": "Видим неке датотеке... и директоријум 'шума'. Како идем тамо?"},
        {"character": "Терминал", "line": "'cd шума' вас помера унутра. 'cd ..' вас враћа назад. Размишљајте о директоријумима као о стазама — уђете, изађете. А 'mkdir' прави ново склониште — нови директоријум. Прво: подигните камп."}
      ]
    },
    "heist": {
      "title": "Соба за брифинг",
      "dialogue": [
        {"character": "Приповедач", "line": "Слабо осветљена соба. Један лаптоп на челичном столу. Седнете. Глас пуцкета кроз слушалицу."},
        {"character": "Вођа", "line": "Добродошли у тим, новајлијо. Кодно име: Дух. Ја сам ваш вођа. Све што радимо иде кроз терминал. Без графичког интерфејса, без трагова."},
        {"character": "Дух", "line": "Унутра сам. Који је први потез?"},
        {"character": "Вођа", "line": "Правило један: увек знајте где сте. Укуцајте 'pwd' — Print Working Directory. Ако не знате свој положај, већ сте компромитовани."},
        {"character": "Дух", "line": "Разумем. /операције/припрема. И треба да видим шта је овде?"},
        {"character": "Вођа", "line": "'ls' — испишите све. Користите 'ls -la' за пуне информације: скривене датотеке, дозволе, временске ознаке. У овом послу, скривене ствари су најважније."},
        {"character": "Дух", "line": "Видим директоријуме: трезор, комуникације, екстракција. Како се померам?"},
        {"character": "Вођа", "line": "'cd трезор' вас увлачи унутра. 'cd ..' вас извлачи. А 'mkdir' прави нову тачку за остављање — директоријум за скривање датотека. Подигните припремну зону. Биће нам потребна."}
      ]
    }
  }
}
