{
  "tutorial": "Основе Bash",
  "technical_concept": "grep — претражује текстуалне обрасце унутар датотека. Употреба: grep \"образац\" датотека.txt. Заставице: -i (без разликовања великих/малих слова), -r (рекурзивно кроз директоријуме), -n (бројеви редова). Име значи Global Regular Expression Print. Међу хакерима постоји изрека: 'You can't grep dead trees' — значи да се дигитални текст може претражити тренутно, а папир не. То је ваша предност.\n\nfind — лоцира датотеке по имену, величини или типу кроз директоријуме. Употреба: find . -name \"*.txt\" налази све .txt датотеке од тренутног директоријума надоле.",
  "challenge": {
    "task": "Претражите датотеку 'server.log' за све редове који садрже 'ERROR' (без разликовања великих/малих слова).",
    "hint": "Користите 'grep -i \"ERROR\" server.log' — заставица -i чини претрагу неосетљивом на величину слова."
  },
  "styles": {
    "survival": {
      "title": "Праћење знакова",
      "dialogue": [
        {"character": "Терминал", "line": "Подигли сте камп, прикупили ресурсе. Сада морате да научите да пратите — да налазите ствари у дивљини. 'grep' је ваш трагач. Лови текстуалне обрасце унутар датотека."},
        {"character": "Ви", "line": "Као тражење отисака?"},
        {"character": "Терминал", "line": "Тачно. 'grep \"вода\" белешке.txt' налази сваки ред који помиње воду. Додајте '-i' и игнорише величину слова — 'Вода', 'ВОДА', 'вода' — све одговара. Додајте '-n' за бројеве редова, као GPS координате за сваки налаз."},
        {"character": "Ви", "line": "Шта ако не знам у којој датотеци да тражим?"},
        {"character": "Терминал", "line": "Ту ступа 'find'. То је ваш извиђач из ваздуха. 'find . -name \"*.txt\"' претражује одавде надоле за било шта што се завршава на .txt. Тачка значи 'почни одакле стојим.' Претражује сваку стазу, сваки поддиректоријум."},
        {"character": "Ви", "line": "Значи grep гледа унутар датотека, а find тражи саме датотеке?"},
        {"character": "Терминал", "line": "Сада размишљате као преживели. У овом подручју постоји дневник сервера — нешто што је оставио ко год је био овде пре вас. Претражите га за грешке. Можда ће нам рећи шта је кренуло наопако."}
      ]
    },
    "heist": {
      "title": "Извиђање",
      "dialogue": [
        {"character": "Вођа", "line": "Друга фаза: извиђање. Пре сваке операције потребујете обавештајне податке. 'grep' је ваш алат за надзор — скенира датотеке за специфичне обрасце."},
        {"character": "Дух", "line": "Као прислушкивање?"},
        {"character": "Вођа", "line": "Боље. 'grep \"лозинка\" база.txt' налази сваки ред који садржи 'лозинка'. Заставица '-i' игнорише величину — хвата 'Лозинка', 'ЛОЗИНКА', све. '-n' вам даје бројеве редова за прецизну екстракцију. '-r' иде рекурзивно — скенира цела стабла директоријума."},
        {"character": "Дух", "line": "Шта ако треба да нађем специфичну датотеку а не знам где је?"},
        {"character": "Вођа", "line": "'find' је ваш план зграде. 'find . -name \"*.log\"' мапира сваку дневничку датотеку из вашег тренутног положаја. Претражује сваку собу, сваки орман, сваки поддиректоријум. Комбиновано са grep, можете наћи било коју информацију у било којој датотеци било где."},
        {"character": "Дух", "line": "Нађи датотеку, греп садржај. Разумем."},
        {"character": "Вођа", "line": "У систему мете постоји дневник сервера. Нешто је кренуло наопако на њиховој страни — нађите грешке. То је наш пут унутра."}
      ]
    }
  }
}
