{
  "tutorial": "Основе Bash",
  "technical_concept": "Цев | је најмоћнији концепт у башу. Узима излаз једне команде и прослеђује га као улаз следећој. За разлику од ; (која само покреће команде по реду), | их повезује — подаци теку кроз.\n\nhead -n N — показује првих N редова.\ntail -n N — показује последњих N редова.\nsort — сортира редове абецедно или нумерички (-n).\nuniq — уклања суседне дупликате (увек прво сортирајте).\nwc -l — броји редове.",
  "challenge": {
    "task": "Користите цевовод за читање 'access.log', сортирање редова, уклањање дупликата и бројање преосталих јединствених редова. Ваш излаз треба да буде само број.",
    "hint": "Знате ; за покретање по реду. Цев | је другачија — прослеђује излаз даље. Колико фаза треба овом цевоводу?"
  },
  "styles": {
    "survival": {
      "title": "Прављење водног филтера",
      "dialogue": [
        {"character": "Терминал", "line": "Научили сте да налазите ствари. Сада научите да их трансформишете. У дивљини, сирова вода захтева филтрирање — свака фаза уклања нешто. Баш цевоводи раде на исти начин."},
        {"character": "Ви", "line": "Цевоводи?"},
        {"character": "Терминал", "line": "Симбол цеви '|' повезује команде. Излаз једне тече у улаз следеће. Као вода кроз серију филтера. 'cat подаци.txt | sort | uniq' — прочитај податке, сортирај их, уклони дупликате. Три фазе, један чист резултат."},
        {"character": "Ви", "line": "Значи свака команда ради једну ствар, а цев их повезује?"},
        {"character": "Терминал", "line": "То је Јуникс филозофија — мали алати који раде једну ствар добро, повезани цевима. 'head -n 5' узима првих 5 редова. 'tail -n 3' узима последња 3. 'sort' све сређује. 'uniq' уклања дупликате. 'wc -l' броји редове."},
        {"character": "Ви", "line": "Као прављење алата за преживљавање од мањих делова."},
        {"character": "Терминал", "line": "Тачно. У старој испостави постоји дневник приступа — има понављајуће уносе. Филтрирајте га: прочитајте, сортирајте, уклоните дупликате, пребројте шта остаје. Колико јединствених сигнала је примљено?"}
      ]
    },
    "heist": {
      "title": "Цевовод",
      "dialogue": [
        {"character": "Вођа", "line": "Овде постаје озбиљно, Дух. Цев — симбол '|' — је кичма сваке операције. Уланчава команде заједно. Излаз једне постаје улаз следеће."},
        {"character": "Дух", "line": "Као штафетни тим који предаје информације?"},
        {"character": "Вођа", "line": "Тачно. 'cat подаци.txt | sort | uniq' — прочитај сирове податке, сортирај их, уклони дупликате. Три оперативца, један чист цевовод. Сваки обави свој посао и проследи резултат даље."},
        {"character": "Дух", "line": "Које друге оперативце имам?"},
        {"character": "Вођа", "line": "'head -n 10' зграби првих 10 редова — врх гомиле. 'tail -n 5' зграби последњих 5 — најновије информације. 'sort' све ставља у ред. 'uniq' елиминише сувишне поруке. 'wc -l' вам даје бројање."},
        {"character": "Дух", "line": "Мали, специјализовани, уланчани заједно. Свиђа ми се."},
        {"character": "Вођа", "line": "Пресрели смо дневник приступа из система мете. Пун је шума — понављајући уноси, дуплиране трансмисије. Очистите га: сортирајте, уклоните дупликате, пребројте јединствене уносе. Колико стварних конекција је било?"}
      ]
    }
  }
}
