{
  "tutorial": "Основе Bash",
  "technical_concept": "'xargs' је мост између проналажења ствари и деловања на њих. Узима листу ставки из stdin и прослеђује их као аргументе другој команди. 'find . -name \"*.tmp\" | xargs rm' налази све .tmp датотеке и брише их у једном замаху. Без xargs морали бисте их брисати једну по једну. Моћан цевовод: 'cat log.txt | grep \"ERROR\" | awk \"{print $1}\" | sort | uniq -c' — чита дневник, филтрира грешке, извлачи први стубац, сортира и броји појављивања.",
  "challenge": {
    "task": "Користите find и xargs за брисање свих датотека које се завршавају на '.tmp' из тренутног стабла директоријума, затим проверите са 'find . -name \"*.tmp\"' (не треба да врати ништа).",
    "hint": "Користите 'find . -name \"*.tmp\" | xargs rm && find . -name \"*.tmp\"'"
  },
  "styles": {
    "survival": {
      "title": "Екипа за чишћење",
      "dialogue": [
        {"character": "Терминал", "line": "Научили сте да градите цевоводе — свака команда обави свој посао и проследи резултат. Али шта ако треба да предузмете акцију на целој листи ствари одједном? Ту ступа 'xargs'."},
        {"character": "Ви", "line": "Акција? Каква?"},
        {"character": "Терминал", "line": "Замислите да сте нашли 50 сувих грана расутих по кампу — датотеке које се завршавају на .tmp. 'find . -name \"*.tmp\"' их све налази. Али find само исписује. Не ради ништа. Потребан вам је неко да их одвезе."},
        {"character": "Ви", "line": "И xargs је превозник?"},
        {"character": "Терминал", "line": "Најбољи превозник. 'find . -name \"*.tmp\" | xargs rm' — find узима листу, цев је прослеђује, а xargs предаје сваку ставку команди 'rm'. Педесет датотека, једна команда. Без ручног рада."},
        {"character": "Ви", "line": "Значи xargs претвара листу у аргументе за другу команду?"},
        {"character": "Терминал", "line": "Тачно. Он је мост између 'проналажења' и 'деловања'. И скалабилан је — било 5 датотека или 5.000. Сада комбинујте ово са свим што знате: find, grep, sort, uniq, xargs. Можете градити цевоводе који претражују, филтрирају, трансформишу и делују. Очистите камп — свуда су расуте .tmp датотеке."}
      ]
    },
    "heist": {
      "title": "Координатор екипе",
      "dialogue": [
        {"character": "Вођа", "line": "Слушајте пажљиво, Дух. Ово је најважнији алат у вашој опреми: 'xargs'. То је ваш координатор екипе. Дате му листу мета и он распоређује оперативце да се баве сваком појединачно."},
        {"character": "Дух", "line": "Дајте ми пример."},
        {"character": "Вођа", "line": "'find . -name \"*.tmp\" | xargs rm' — find извиђа све .tmp датотеке. Цев прослеђује листу xargs-у. xargs предаје сваку датотеку команди 'rm' за елиминацију. Педесет мета, један координирани удар."},
        {"character": "Дух", "line": "Значи xargs премошћује јаз између извиђања и акције?"},
        {"character": "Вођа", "line": "Тачно тако. Без xargs 'find' вам само даје листу. Са xargs та листа постаје листа мета. Ради са било којом командом — rm, cat, grep, било чим. То је разлика између знати где су мете и заиста деловати."},
        {"character": "Дух", "line": "А моћан цевовод који сте поменули?"},
        {"character": "Вођа", "line": "'cat log.txt | grep ERROR | awk \"{print $1}\" | sort | uniq -c' — прочитај дневнике, филтрирај грешке, извуци временске ознаке, сортирај их, преброј понављања. Пуна анализа обавештајних података у једном реду. Сада очистите — у систему мете свуда су .tmp датотеке. Докази који морају да нестану."}
      ]
    }
  }
}
