{
  "tutorial": "Основе Bash",
  "technical_concept": "'sed' (Stream Editor) врши замену текста на току. 'sed \"s/старо/ново/\"' замењује прво појављивање по реду. Додајте 'g' за све: 'sed \"s/старо/ново/g\"'. 'awk' обрађује податке у стубцима — сваки ред дели на поља ($1, $2 итд.) по размацима. 'awk \"{print $1}\"' исписује први стубац. Заједно са цевима, sed и awk вам омогућавају трансформацију било којих текстуалних података у лету.",
  "challenge": {
    "task": "Користите awk за извлачење само IP адреса (први стубац) из 'access.log', затим проследите кроз sort и uniq -c за бројање захтева по IP адреси.",
    "hint": "Користите 'awk '{print $1}' access.log | sort | uniq -c'"
  },
  "styles": {
    "survival": {
      "title": "Теренска операција на тексту",
      "dialogue": [
        {"character": "Терминал", "line": "Можете да нађете податке, филтрирате их, сортирате. Али понекад морате да их промените — извршите операцију. Упознајте 'sed', Уређивач токова. Оперише на тексту док тече кроз."},
        {"character": "Ви", "line": "Операција?"},
        {"character": "Терминал", "line": "'echo \"прљава вода\" | sed \"s/прљава/чиста/\"' — 's' значи замени. Налази 'прљава' и замењује са 'чиста'. Текст протече кроз цев, sed оперише, чист резултат излази. Као пречишћавање воде."},
        {"character": "Ви", "line": "Шта са подацима у стубцима? Као табела?"},
        {"character": "Терминал", "line": "То је 'awk' — ваш теренски специјалиста. Сваки ред види као стубце раздвојене размацима. $1 је први стубац, $2 други, итд. 'awk \"{print $1}\"' извлачи само први стубац из сваког реда."},
        {"character": "Ви", "line": "Значи ако имам дневничку датотеку са временским ознакама, IP адресама и порукама..."},
        {"character": "Терминал", "line": "'awk \"{print $1}\"' зграби само временске ознаке. Проследите то кроз sort и uniq -c и тачно знате кад су се ствари дешавале и колико често. У старој испостави постоји дневник приступа. Извуците IP адресе и пребројте које су се најчешће повезивале."}
      ]
    },
    "heist": {
      "title": "Фалсификовање докумената",
      "dialogue": [
        {"character": "Вођа", "line": "Још два алата за вашу опрему, Дух. 'sed' — фалсификатор. Преписује текст у транзиту. 'awk' — аналитичар. Сецира структуриране податке стубац по стубац."},
        {"character": "Дух", "line": "Покажите ми sed."},
        {"character": "Вођа", "line": "'echo \"Агент Смит\" | sed \"s/Смит/Дух/\"' — sed пресреће ток и замењује 'Смит' са 'Дух'. 's' значи замени. Додајте 'g' на крај за замену сваког појављивања у реду, не само првог."},
        {"character": "Дух", "line": "А awk?"},
        {"character": "Вођа", "line": "awk третира сваки ред као ред табеле. $1 је стубац један, $2 је стубац два. 'ls -l | awk \"{print $5, $9}\"' извлачи величине датотека и имена — само информације које су вам потребне, ништа сувишно."},
        {"character": "Дух", "line": "Значи могу да извучем специфична поља из било којих структурираних података?"},
        {"character": "Вођа", "line": "Комбиновано са цевима можете градити пуне аналитичке ланце: извуците, филтрирајте, трансформишите, пребројте. Имамо дневник приступа из мете. Извуците IP адресе, сортирајте их, пребројте конекције. Сазнајте ко је најчешће приступао њиховом систему."}
      ]
    }
  }
}
