{
  "tutorial": "Основе Bash",
  "technical_concept": "'chmod' мења дозволе датотека — 'chmod +x скрипта.sh' чини датотеку извршивом. 'curl' преноси податке са URL-ова — одличан за тестирање API-ја и преузимање датотека. 'wget' директно преузима датотеке. 'history' показује ваше недавне команде — користите '!42' за поновно покретање команде #42. 'alias' прави пречице — 'alias ll=\"ls -la\"' вам омогућава да укуцате 'll' уместо. 'top' приказује покренуте процесе и потрошњу ресурса као менаџер задатака.",
  "challenge": {
    "task": "Ово је лекција за дискусију — без оцењивања. Реците ми: који од ових алата (chmod, curl, wget, history, alias, top) мислите да бисте највише користили у свакодневном раду, и зашто?",
    "hint": "Нема погрешног одговора! Размислите шта највише радите — скриптовање (chmod), рад са API-јем (curl), преузимања (wget), продуктивност (alias, history) или надзор (top)."
  },
  "styles": {
    "survival": {
      "title": "Комплет алата за преживљавање",
      "dialogue": [
        {"character": "Терминал", "line": "Изградили сте склониште, прикупили ресурсе, научили да пратите и филтрирате. Сада напунимо ваш појас са алатима преосталим прибором. Ово су они по које ћете посегнути у специфичним ситуацијама."},
        {"character": "Ви", "line": "Само напред."},
        {"character": "Терминал", "line": "'chmod' контролише дозволе — ко може да чита, пише или извршава датотеку. 'chmod +x скрипта.sh' чини скрипту покретљивом. Без тога систем неће дозволити извршавање ваших сопствених алата. Као оштрење ножа пре употребе."},
        {"character": "Ви", "line": "Шта са добијањем ствари споља?"},
        {"character": "Терминал", "line": "'curl' преузима податке са URL-ова — API-је, веб странице, датотеке. То је ваш алат за комуникацију на даљину. 'wget' је једноставнији — усмерите га на URL, преузима датотеку. Замислите curl као радио а wget као допрему залиха."},
        {"character": "Ви", "line": "А алати за продуктивност?"},
        {"character": "Терминал", "line": "'history' показује сваку команду коју сте укуцали — ваш теренски дневник. 'alias' прави пречице за дуге команде — 'alias ватра=\"echo прављење ватре\"' значи мање куцања. А 'top' је ваша стражарница — приказује све покренуте процесе, потрошњу процесора, меморију. Ваша контролна табла за ситуациону свест."},
        {"character": "Ви", "line": "Који од ових би био најкориснији за свакодневни рад?"},
        {"character": "Терминал", "line": "То зависи од ваше мисије. Скриптер живи по chmod. Програмер API-ја дише curl. Напредни корисник се куне у алиасе. По чему бисте ВИ најчешће посегли?"}
      ]
    },
    "heist": {
      "title": "Кофер са справама",
      "dialogue": [
        {"character": "Вођа", "line": "Последњи брифинг о преосталим справама, Дух. Ово су специјалистички алати — сваки има специфичан случај употребе."},
        {"character": "Дух", "line": "Хајде да прођемо кроз њих."},
        {"character": "Вођа", "line": "'chmod' — контрола дозвола. 'chmod +x скрипта.sh' активира скрипту за извршавање. Без тога су ваши прилагођени алати само текстуалне датотеке. Сваки оперативац мора да учини своје скрипте извршивим."},
        {"character": "Дух", "line": "Комуникациони алати?"},
        {"character": "Вођа", "line": "'curl' — ваш шифровани комуникациони канал. Разговара са веб API-јима, преноси податке, шаље захтеве са прилагођеним заглављима. Савршен за комуникацију са командним центром. 'wget' је једноставнији рођак — усмери и преузми. Добар за преузимање датотека са сервера за остављање."},
        {"character": "Дух", "line": "Шта са оперативном безбедношћу?"},
        {"character": "Вођа", "line": "'history' бележи сваку команду коју сте укуцали — корисно за праћење корака, опасно ако остане иза вас. 'alias' прави кодна имена за команде — 'alias скен=\"nmap -sV\"' значи да ваши притисци тастера изгледају невино. А 'top' је ваш надзорни извор — приказује сваки покренути процес. Знајте шта ради и никад нећете бити изненађени."},
        {"character": "Дух", "line": "Добар арсенал. Који су кључни за мисију?"},
        {"character": "Вођа", "line": "Зависи од операције. Свака пљачка је другачија. Које алате бисте ви ставили у први план за ваш посао?"}
      ]
    }
  }
}
