{
  "tutorial": "Основе Bash",
  "technical_concept": "Баш скрипта је датотека која садржи низ команди. Почиње са '#!/bin/bash' (shebang) што говори систему да користи bash. Променљиве чувају вредности: ИМЕ=\"свет\". 'read' добија унос од корисника. 'echo' исписује излаз. Скрипте комбинују све што сте научили — операције са датотекама, цеви, услове — у програме за вишеструку употребу. Сачувајте као .sh, учините извршивим са 'chmod +x' и покрените са './скрипта.sh'.",
  "challenge": {
    "task": "Напишите баш скрипту која: 1) Прави директоријум под именом 'mysite', 2) Прави 'index.html' и 'style.css' унутра, 3) Уписује '<h1>Hello World</h1>' у index.html, 4) Исписује садржај mysite/, 5) На крају исписује 'Done!'. Не заборавите #!/bin/bash shebang!",
    "hint": "Почните са #!/bin/bash, затим користите mkdir, cd, echo '...' > датотека, touch, ls и echo Done!"
  },
  "styles": {
    "survival": {
      "title": "Приручник за преживљавање",
      "dialogue": [
        {"character": "Терминал", "line": "Савладали сте појединачне алате — навигацију, датотеке, претрагу, цеви, обраду текста. Сада је време да их комбинујете у нешто трајно: скрипту. Приручник за преживљавање који можете покретати изнова и изнова."},
        {"character": "Ви", "line": "Скрипта? Као програмирање?"},
        {"character": "Терминал", "line": "Најједноставнија врста. Баш скрипта је само текстуална датотека са командама, једна по реду. Почните са '#!/bin/bash' — то је shebang. Говори систему: 'ова датотека говори bash.' После тога сваки ред се извршава по реду, исто као кад бисте куцали команде једну по једну."},
        {"character": "Ви", "line": "Може ли да памти ствари? Као име?"},
        {"character": "Терминал", "line": "Променљиве. 'ИМЕ=\"базни камп\"' чува вредност. '$ИМЕ' је призива. 'read ОДГОВОР' чека на ваш унос. Можете градити интерактивне алате — скрипту која вас пита шта вам треба и то гради за вас."},
        {"character": "Ви", "line": "Значи могу аутоматизовати подизање кампа сваки пут?"},
        {"character": "Терминал", "line": "Тачно. Једна скрипта која прави директоријуме, генерише датотеке, уписује садржај — цело подизање кампа једном командом. Сваки велики преживели аутоматизује понављајуће задатке. Напишите скрипту која гради малу структуру веб странице. Докажите да можете аутоматизовати преживљавање."}
      ]
    },
    "heist": {
      "title": "Главни план",
      "dialogue": [
        {"character": "Вођа", "line": "Ово је то, Дух. Последња лекција. Све што сте научили — навигација, рад са датотекама, извиђање, цеви, xargs, обрада текста — све се спаја у скрипти. Главни план."},
        {"character": "Дух", "line": "Скрипта повезује све заједно?"},
        {"character": "Вођа", "line": "Баш скрипта је ваш оперативни приручник. Почиње са '#!/bin/bash' — заглавље кодног имена. После тога сваки ред је корак у плану. Извршавају се по реду, од врха до дна. Без ручне интервенције."},
        {"character": "Дух", "line": "Променљиве?"},
        {"character": "Вођа", "line": "'МЕТА=\"трезор\"' — чува име мете. '$МЕТА' је призива било где у скрипти. 'read УНОС' се паузира и чека на вашу одлуку. Скрипте можете учинити интерактивним — план се прилагођава условима на терену."},
        {"character": "Дух", "line": "Значи план напишем једном и извршим га једном командом?"},
        {"character": "Вођа", "line": "То је разлика између аматера и професионалца. Аматери куцају команде једну по једну. Професионалци напишу целу операцију у скрипту. Напишите ми скрипту која подиже веб пројекат — директоријум, датотеке, садржај, потврду. Покажите ми да можете испланирати чисту операцију од почетка до краја."}
      ]
    }
  }
}
