{
  "tutorial": "Гит из терминала",
  "technical_concept": "Гит премешта ваше фајлове између четири области: Радни директоријум (ваши фајлови на диску), Стејџинг област (оно што сте изабрали за следећи комит), Локални репозиторијум (ваша историја у .git/) и Удаљени репозиторијум (ГитХаб). Свака Гит команда једноставно премешта нешто између ових области. Ваш десктоп алат вам је сакрио Стејџинг област — то је кључни део који вам је недостајао.",
  "challenge": {
    "task": "Направите фајл 'notes.txt' са садржајем 'first draft', припремите га са git add, затим направите комит са поруком 'Add notes'.",
    "hint": "Потребна су вам три корака: echo за креирање фајла, git add за припрему и git commit -m за комит. Повежите их са &&.",
    "solution": "echo 'first draft' > notes.txt && git add notes.txt && git commit -m 'Add notes'"
  },
  "styles": {
    "socratic": {
      "title": "Геометрија контроле верзија",
      "dialogue": [
        {"character": "Сократ", "line": "Дођи, пријатељу. Кажеш да познајеш Гит — да га свакодневно користиш. Је ли тако?"},
        {"character": "Ученик", "line": "Да, Сократе. Комитујем, пушујем, пулујем. Већ од годину дана користим ГитХаб Десктоп."},
        {"character": "Сократ", "line": "Одлично! Онда ми реци — кад кликнеш 'Commit' у свом алату, куда тачно иде твој код?"},
        {"character": "Ученик", "line": "У... репозиторијум?"},
        {"character": "Сократ", "line": "Који репозиторијум? Онај на твојој машини или онај на ГитХабу?"},
        {"character": "Ученик", "line": "Ја... хмм. Претпостављам прво у локални? Онда пушујем на ГитХаб?"},
        {"character": "Сократ", "line": "Добро — већ си на пола пута. Сада, твој алат има чекбокс поред сваког фајла пре комита. Шта је то?"},
        {"character": "Ученик", "line": "То је за избор који фајлови да се укључе у комит."},
        {"character": "Сократ", "line": "Тачно тако. А у терминалу, та селекција је своје засебно место — Стејџинг област. Твој алат ју је сакрио иза чекбокса. Погледај дијаграм: четири области, четири стрелице. Свака Гит команда коју ћеш икад научити једноставно премешта фајлове између њих."},
        {"character": "Ученик", "line": "Значи 'git add' је чекбокс? А 'git commit' је клик на дугме Commit?"},
        {"character": "Сократ", "line": "Сада видиш. 'git add' премешта фајл из Радног директоријума у Стејџинг област. 'git commit' премешта све припремљено у Локални репозиторијум. 'git push' шаље на Удаљени. А 'git status' — то је твој компас. Каже ти тачно где се сваки фајл тренутно налази."},
        {"character": "Ученик", "line": "А 'git pull'?"},
        {"character": "Сократ", "line": "То је обрнути пут — од Удаљеног на твоју машину. Преузима комите, затим их спаја у твој Радни директоријум. Два корака маскирана као један. Сада — немојмо само причати о томе. Покажи ми комплетно путовање фајла, од креирања до записане историје."}
      ]
    },
    "zen": {
      "title": "Четири врта",
      "dialogue": [
        {"character": "Мајстор", "line": "Пре него што си упознао ГУИ, Гит је био једноставан. Кад си упознао ГУИ, Гит је постао компликован. Кад научиш терминал... Гит ће опет бити једноставан."},
        {"character": "Ученик", "line": "Мајсторе, Гит користим већ дуго. Зашто сам још увек збуњен?"},
        {"character": "Мајстор", "line": "Јер ти је твој алат показао прозор у кућу, али никад саму кућу. Реци ми — на колико места може бити фајл?"},
        {"character": "Ученик", "line": "Два? На мом рачунару и на ГитХабу?"},
        {"character": "Мајстор", "line": "Четири. Проучи дијаграм. Фајл почиње у Радном директоријуму — твој врт сирове земље. Са 'git add' улази у Стејџинг област — место намере, где одлучујеш шта ће следећи тренутак историје садржати."},
        {"character": "Ученик", "line": "Мој ГУИ никад није споменуо Стејџинг област."},
        {"character": "Мајстор", "line": "Била је тамо. Сакривена иза чекбокса. ГУИ је изабрао једноставност уместо разумевања. Ми бирамо разумевање."},
        {"character": "Ученик", "line": "А трећа и четврта област?"},
        {"character": "Мајстор", "line": "Са 'git commit' твоја намера постаје историја — сачувана у Локалном репозиторијуму, .git фолдеру на твојој машини. Са 'git push' та историја путује на Удаљени — ГитХаб, где је други могу примити."},
        {"character": "Ученик", "line": "Значи свака команда је само... премештање између четири места?"},
        {"character": "Мајстор", "line": "Сада држиш цео Гит у једној мисли. Кад си изгубљен, врати се на четири области и питај: где сам и куда желим да идем?"},
        {"character": "Ученик", "line": "Како знам где сам?"},
        {"character": "Мајстор", "line": "'git status'. То је мирна вода која одражава истину. Користи га пре сваке акције, после сваке акције. Сада — ходај стазом сам. Креирај фајл, пренеси га кроз области и направи од њега историју."}
      ]
    },
    "pair_programming": {
      "title": "Чекај, куда је отишао мој код?",
      "dialogue": [
        {"character": "Алекс", "line": "Океј, коначно сам инсталирао Гит у терминалу. Годину дана сам користио ГитХаб Десктоп али мој нови тим хоће да радим у командној линији."},
        {"character": "Сам", "line": "Без бриге, већ познајеш Гит. Само не знаш да га познајеш. Брзо питање — кад си кликнуо Commit у ГитХаб Десктопу, шта се десило?"},
        {"character": "Алекс", "line": "Је... сачувало моје измене?"},
        {"character": "Сам", "line": "Где?"},
        {"character": "Алекс", "line": "У... Гиту?"},
        {"character": "Сам", "line": "Ха. Океј, погледај овај дијаграм. Твој код може бити на четири места. Радни директоријум — то су једноставно твоји фајлови на диску. Стејџинг област — то је она ствар са чекбоксовима у ГитХаб Десктопу где си бирао које фајлове да укључиш."},
        {"character": "Алекс", "line": "Чекај, Стејџинг област су чекбоксови? То је све?"},
        {"character": "Сам", "line": "То је све. 'git add' је чекбокс. Онда 'git commit' чува у твој Локални репозиторијум — то је .git фолдер на твојој машини. А 'git push' шаље на ГитХаб. Четири места, четири команде."},
        {"character": "Алекс", "line": "Значи кад сам у ГУИ-ју кликнуо 'Push', само је покренуо 'git push' у позадини?"},
        {"character": "Сам", "line": "Тачно тако. А 'Pull' је био 'git pull', што је заправо 'git fetch' плус 'git merge' заједно. Твој ГУИ је цело време покретао терминалне команде — само ти није рекао."},
        {"character": "Алекс", "line": "Океј, то ме заправо чини да се боље осећам. Шта је са 'git status'?"},
        {"character": "Сам", "line": "То ти је сад најбољи друг. Каже ти где је сваки фајл — шта је модификовано, шта припремљено, шта непраћено. Покрећи га стално. Пре него урадиш било шта, покрени git status. После него урадиш било шта, покрени git status."},
        {"character": "Алекс", "line": "Разумем. Значи цео ток рада је: направи измене, git add, git commit, git push?"},
        {"character": "Сам", "line": "То је дневни циклус. Хајде да то урадимо за право — креирај фајл, припреми га, комитуј. Руке на тастатуру."}
      ]
    }
  }
}
