{
  "tutorial": "Основе Git",
  "technical_concept": "Увод у Git контролу верзија и провера стања репозиторијума.",
  "challenge": {
    "task": "Проверите стање вашег Git репозиторијума да видите шта се прати.",
    "hint": "Користите 'git status' да видите тренутно стање вашег репозиторијума."
  },
  "styles": {
    "detective_noir": {
      "title": "Случај контроле верзија",
      "dialogue": [
        {"character": "Детектив Индекс", "line": "Радио сам на много случајева, али ништа се не пореди са трагањем за изгубљеним кодом. Мислиш да знаш где је, а онда пуф — нестао. Препис ан. Изгубљен заувек."},
        {"character": "REDIS", "line": "За то вам треба Git, детективе. Систем за контролу верзија. Прати сваку промену, сваки ред, сваки потез. Ништа није заиста изгубљено."},
        {"character": "Детектив Индекс", "line": "Како да почнем?"},
        {"character": "REDIS", "line": "Прво проверите стање са 'git status'. Каже вам где сте — на којој грани сте, шта се променило, шта је спремно. Као ваш дневни преглед случаја."},
        {"character": "Детектив Индекс", "line": "Преглед стања на терену. Разумем. Шта ми показује?"},
        {"character": "REDIS", "line": "Приказује фајлове у три стања: праћени и непромењени, промењени али неспремни, и непраћени — потпуно нови фајлови. Комплетан преглед ситуације."},
        {"character": "Детектив Индекс", "line": "У реду, хајде да видимо с чиме располажемо."}
      ]
    },
    "sci_fi": {
      "title": "Иницијализација репозиторијума",
      "dialogue": [
        {"character": "НЕКСУС", "line": "Инжењеру, систем за контролу верзија је активан. Git складиште је иницијализовано и спремно за операције."},
        {"character": "Инжењер", "line": "Морам да проверим тренутно стање складишта. Који фајлови се прате?"},
        {"character": "НЕКСУС", "line": "Извршите 'git status' за свеобухватан преглед стања. Приказује тренутну грану, спремне промене и непраћене фајлове."},
        {"character": "Инжењер", "line": "Значи каже ми шта се променило од последњег записа?"},
        {"character": "НЕКСУС", "line": "Тачно. Фајлови су категорисани у три групе: праћени/непромењени, промењени/неспремни и непраћени. Комплетан преглед стања система."},
        {"character": "Инжењер", "line": "Извршимо проверу стања."},
        {"character": "НЕКСУС", "line": "Чекам вашу команду, инжењеру."}
      ]
    }
  }
}
