{
  "tutorial": "Гит из терминала",
  "technical_concept": "Грана није копија вашег кода. То је мали фајл који садржи један 40-карактерни хеш који показује на комит. Креирање гране је тренутно јер Гит не копира ништа — само запише нови показивач. HEAD је још један показивач који каже Гиту на којој сте грани тренутно. Спајање доноси комите једне гране у другу — увек прво пређите на циљну грану.",
  "challenge": {
    "task": "Креирајте нову грану 'feature', пређите на њу, креирајте фајл 'feature.txt', припремите га и комитујте са поруком 'Add feature', затим се вратите на main и спојте грану feature.",
    "hint": "Користите 'git switch -c feature' за креирање и прелаз, затим уобичајени add/commit циклус, затим 'git switch main' и 'git merge feature'.",
    "solution": "git switch -c feature && echo 'new feature' > feature.txt && git add feature.txt && git commit -m 'Add feature' && git switch main && git merge feature"
  },
  "styles": {
    "socratic": {
      "title": "Природа гранања",
      "dialogue": [
        {"character": "Сократ", "line": "Реци ми — кад креираш грану у свом десктоп алату, шта мислиш да се деси?"},
        {"character": "Ученик", "line": "Гит направи копију свих мојих фајлова на новој грани, зар не?"},
        {"character": "Сократ", "line": "Разумно уверење. А колико времена треба?"},
        {"character": "Ученик", "line": "Тренутно. Чак и на великим пројектима."},
        {"character": "Сократ", "line": "Тренутно! А ипак кажеш да Гит копира све твоје фајлове? Реци ми — кад бих те замолио да копираш хиљаду фајлова, да ли би то било тренутно?"},
        {"character": "Ученик", "line": "Не, то би трајало. Значи... Гит не копира фајлове?"},
        {"character": "Сократ", "line": "Не копира. Грана је мали фајл — четрдесет карактера дуг — који садржи хеш комита. Ништа више. Кад 'креираш грану', Гит запише један мали фајл. Зато је тренутно."},
        {"character": "Ученик", "line": "Само показивач? Шта је онда HEAD?"},
        {"character": "Сократ", "line": "Још један показивач! HEAD показује на грану на којој си тренутно. Кад мењаш гране, само се HEAD промени — показује на други фајл гране. Проучи дијаграм: показивачи до самог дна."},
        {"character": "Ученик", "line": "А спајање?"},
        {"character": "Сократ", "line": "Кад спајаш, Гит узима комите из једне гране и уплиће их у другу. Али ево кључне ствари — прво мораш стајати на грани која ће примити рад. Пређи на main, затим споји feature у њу."},
        {"character": "Ученик", "line": "Значи увек идем прво на одредиште, затим спајам извор у њега?"},
        {"character": "Сократ", "line": "Тачно тако. А после спајања, грана feature је одрадила своје. Обриши је. Чиста радионица је бистар ум. Сада — креирај грану, уради неки посао, врати се и споји. Комплетан циклус."}
      ]
    },
    "zen": {
      "title": "Прст који показује на месец",
      "dialogue": [
        {"character": "Мајстор", "line": "Шта је грана?"},
        {"character": "Ученик", "line": "Копија кода, да могу радити без квварења ствари."},
        {"character": "Мајстор", "line": "Описујеш шта ради, не шта јесте. Грана није дрво. То је прст који показује на месец."},
        {"character": "Ученик", "line": "Не разумем."},
        {"character": "Мајстор", "line": "Грана је показивач — четрдесет карактера записаних у малом фајлу. Показује на комит, ништа више. Гит не копира ништа кад креираш грану. Запише једну линију."},
        {"character": "Ученик", "line": "Зато је тренутно?"},
        {"character": "Мајстор", "line": "Почињеш да видиш. А HEAD — знаш ли шта је HEAD?"},
        {"character": "Ученик", "line": "Тренутни комит?"},
        {"character": "Мајстор", "line": "Близу. HEAD је показивач на грану, која је показивач на комит. Прст који показује на прст који показује на месец. 'git switch' једноставно помера куда HEAD показује."},
        {"character": "Ученик", "line": "А спајање спаја две гране?"},
        {"character": "Мајстор", "line": "Да, али са намером. Прво стани тамо где желиш да река тече — пређи на примајућу грану. Затим позови други ток унутра. 'git merge' спаја токове."},
        {"character": "Ученик", "line": "Шта се дешава са feature граном после?"},
        {"character": "Мајстор", "line": "Одрадила је свој посао. Пусти је. 'git branch -d' уклања показивач. Комити остају — сада су део историје main-а. Сада иди: креирај, гранај, ради, врати се, споји. Осети циклус."}
      ]
    },
    "pair_programming": {
      "title": "Гране су практично бесплатне",
      "dialogue": [
        {"character": "Алекс", "line": "Океј, гранање. У ГитХаб Десктопу сам само кликнуо 'New Branch' и изгледало је као да је све копирало. Да ли терминал ради исту ствар?"},
        {"character": "Сам", "line": "Ево у чему је фора — ГитХаб Десктоп такође ништа није копирао. Само ти није рекао."},
        {"character": "Алекс", "line": "Шта мислиш?"},
        {"character": "Сам", "line": "Грана је мали фајл. Четрдесет карактера. Показивач на комит. Кад 'креираш грану', Гит запише један мали фајл. Зато је тренутно чак и на огромним пројектима."},
        {"character": "Алекс", "line": "Стварно? Значи нема копије мог кода?"},
        {"character": "Сам", "line": "Никакве. Твоји фајлови остају тачно где јесу. Грана само каже 'ја показујем на овај комит.' А HEAD — то је још један показивач који каже 'тренутно сам на овој грани.'"},
        {"character": "Алекс", "line": "Океј, па како заправо креирам једну из терминала?"},
        {"character": "Сам", "line": "'git switch -c feature' — креира грану и прелази на њу у једном потезу. То ћеш користити 90% времена."},
        {"character": "Алекс", "line": "А кад завршим са feature?"},
        {"character": "Сам", "line": "Пређи назад на main са 'git switch main', затим 'git merge feature'. Важно: увек иди прво на грану у коју желиш да спојиш. Затим повуци другу унутра."},
        {"character": "Алекс", "line": "Као да... стојиш на одредишту и кажеш 'дођи овде'?"},
        {"character": "Сам", "line": "Тачно. А после спајања, обриши грану са 'git branch -d feature'. Одржавај ред. Мртве гране свуда је начин на који репозиторијуми постају хаос."},
        {"character": "Алекс", "line": "Важи, да пробам целу ствар — гранај, комитуј, споји назад."},
        {"character": "Сам", "line": "Само напред. Комплетан животни циклус."}
      ]
    }
  }
}
