{
  "tutorial": "Гит из терминала",
  "technical_concept": "git log приказује вашу историју комита — додајте --oneline --graph --all за визуелно стабло свих грана. git diff показује шта се променило (Радни директоријум наспрам Стејџинга, или --staged за Стејџинг наспрам задњег комита). Поништавање се мапира на 4 области: 'git restore' одбацује измене Радног директоријума, 'git restore --staged' уклања из припреме, 'git reset' поништава локалне комите, а 'git revert' безбедно поништава објављене комите креирањем новог поправног комита.",
  "challenge": {
    "task": "Направљен је лош комит. Користите 'git revert HEAD' да га безбедно поништите, затим проверите да лог приказује поништавање.",
    "hint": "git revert креира нови комит који поништава претходни. Користите --no-edit да прихватите подразумевану поруку.",
    "solution": "git revert HEAD --no-edit && git log --oneline"
  },
  "styles": {
    "socratic": {
      "title": "Уметност поништавања",
      "dialogue": [
        {"character": "Сократ", "line": "Много пута си комитовао и пушовао. Али реци ми — да ли си икад морао да поништиш комит?"},
        {"character": "Ученик", "line": "Да! И било је страшно. Никад нисам знао коју команду да користим."},
        {"character": "Сократ", "line": "Јер ниси имао мапу. Сећаш се наше четири области? Свака команда за поништавање циља на одређену област. Ако знаш коју област желиш да вратиш, команда се сама открива."},
        {"character": "Ученик", "line": "Значи ако сам изменио фајл али га нисам још припремио?"},
        {"character": "Сократ", "line": "Онда је штета у Радном директоријуму. 'git restore' одбацује те измене. Шта ако си већ припремио фајл?"},
        {"character": "Ученик", "line": "'git restore --staged' да га вратим из Припреме?"},
        {"character": "Сократ", "line": "Брзо учиш. А шта ако си већ комитовао?"},
        {"character": "Ученик", "line": "Ту сам се увек губио."},
        {"character": "Сократ", "line": "Два пута. Ако је комит само локалан — никад пушован — можеш преписати историју са 'git reset'. Soft задржава твоје измене припремљене. Mixed их враћа у Радни директоријум. Hard... брише све."},
        {"character": "Ученик", "line": "А ако сам већ пушовао?"},
        {"character": "Сократ", "line": "Онда не смеш преписивати историју — твоји сарадници су је већ примили. Уместо тога, 'git revert' креира нови комит који поправља штету. Грешка остаје у историји, али њени ефекти су поништени. Поштено и безбедно."},
        {"character": "Ученик", "line": "Значи revert је за дељени рад, reset за локалне грешке?"},
        {"character": "Сократ", "line": "Сада имаш комплетну слику. Али прво — погледајмо и историју. 'git log --oneline --graph --all' ти показује цело стабло твог репозиторијума. А 'git diff' показује тачно шта се променило. Знај где си пре него покушаш да поништиш. Сада — лош комит те чека. Поправи га безбедно."}
      ]
    },
    "zen": {
      "title": "Ломљење и поправљање",
      "dialogue": [
        {"character": "Мајстор", "line": "Ученик који никад не направи грешку никад не научи да се опорави. Реци ми — шта те највише плаши код Гита?"},
        {"character": "Ученик", "line": "Поништавање ствари. Увек ме страх да ћу изгубити свој рад."},
        {"character": "Мајстор", "line": "Разуман страх, рођен из неразумевања. У Гиту само једна команда може заиста уништити рад: 'git reset --hard'. Све остало је обновљиво. Запамти ово и твој страх ће утихнути."},
        {"character": "Ученик", "line": "Али има толико команди за поништавање. Како да изаберем?"},
        {"character": "Мајстор", "line": "Врати се на четири области. Где је измена коју желиш да поништиш? У Радном директоријуму — користи 'git restore'. У Стејџинг области — 'git restore --staged'. У локалном комиту — 'git reset'. Већ дељено са другима — 'git revert'."},
        {"character": "Ученик", "line": "Која је разлика између reset и revert?"},
        {"character": "Мајстор", "line": "Reset брише комит као да се никад није десио. Revert креира нови комит који поништава стари. Оба решавају проблем. Али reset преписује историју — ако су други већ примили ту историју, креираш забуну."},
        {"character": "Ученик", "line": "Значи revert је избор са поштовањем."},
        {"character": "Мајстор", "line": "За дељене гране, да. Каже: направио сам грешку и ево исправке. Историја је поштена. Пре поништавања увек прво погледај. 'git log --oneline --graph --all' открива комплетан облик твоје историје. 'git diff' показује тачно шта се променило."},
        {"character": "Ученик", "line": "Погледај пре него делујеш."},
        {"character": "Мајстор", "line": "Увек. Лош комит је направљен у твом репозиторијуму. Већ је део историје. Поништи га са поштовањем — креирај revert и посматрај резултат."}
      ]
    },
    "pair_programming": {
      "title": "Јао, како да то поништим",
      "dialogue": [
        {"character": "Алекс", "line": "Саме, мислим да сам управо комитовао нешто покварено. Како то да поништим?"},
        {"character": "Сам", "line": "Без панике. Прво — јеси ли пушовао?"},
        {"character": "Алекс", "line": "Не, још нисам."},
        {"character": "Сам", "line": "Добро. Онда имаш опције. Али пре него ишта поништимо — хајде да видимо шта се десило. Покрени 'git log --oneline'. То показује историју комита, једна линија по комиту."},
        {"character": "Алекс", "line": "О лепо, видим све своје комите. Ево лошег на врху."},
        {"character": "Сам", "line": "Е сад, ево ствари са поништавањима у Гиту — постоји неких пет различитих команди и сви се збуне. Трик је: размисли на коју од четири области желиш да поништиш."},
        {"character": "Алекс", "line": "Четири области из прве лекције?"},
        {"character": "Сам", "line": "Тачно. Изменио фајл али га ниси припремио? 'git restore'. Већ припремио? 'git restore --staged'. Већ комитовао али ниси пушовао? 'git reset'. Већ пушовао? 'git revert'."},
        {"character": "Алекс", "line": "Која је разлика између reset и revert?"},
        {"character": "Сам", "line": "Reset преписује историју — комит нестаје као да се никад није десио. То је океј локално. Али ако си већ пушовао, твоји колеге имају тај комит. Не можеш га просто обрисати са њихових машина. Зато 'git revert' креира НОВИ комит који поништава стари. Историја остаје поштена."},
        {"character": "Алекс", "line": "Разумем. Revert за дељене ствари, reset за локалне."},
        {"character": "Сам", "line": "Тако је. А једно упозорење — 'git reset --hard' је нуклеарна опција. Брише комит И твоје измене. Готово. Све остало је обновљиво, али --hard значи --hard."},
        {"character": "Алекс", "line": "Примљено. Избегавај нуклеарно дугме."},
        {"character": "Сам", "line": "За сад, хајде да вежбамо безбедан начин. У твом репозиторијуму је лош комит — поништи га и провери лог да се увериш да је урадило."}
      ]
    }
  }
}
