{
  "tutorial": "Гит из терминала",
  "technical_concept": "Фолдер .git је комплетна Гитова база података. HEAD је текстуални фајл који показује на вашу тренутну грану. Свака грана је фајл у .git/refs/heads/ који садржи 40-карактерни хеш комита. Фолдер objects/ чува сваку верзију сваког фајла који је икад комитован. Обришите .git и сва историја нестаје — ваши фајлови остају али Гит је нестао. Фајл .gitignore каже Гиту које фајлове да никад не прати: артифакте градње, подешавања IDE-а, тајне, логове.",
  "challenge": {
    "task": "Загледајте у Гитов мозак: прочитајте садржај HEAD фајла са 'cat .git/HEAD' да видите на којој сте грани.",
    "hint": "HEAD је само текстуални фајл унутар .git фолдера. Размислите која основна Linux команда чита садржај фајла.",
    "solution": "cat .git/HEAD"
  },
  "styles": {
    "socratic": {
      "title": "Иза завесе",
      "dialogue": [
        {"character": "Сократ", "line": "Причали смо о гранама, комитима и четири области. Али цело ово време сам те молио да ми верујеш. Хајде сад да проверимо. Где мислиш да Гит чува све?"},
        {"character": "Ученик", "line": "Негде на мом рачунару? У бази података?"},
        {"character": "Сократ", "line": "У скривеном фолдеру који се зове .git, који седи тачно унутар твог пројекта. Без облак сервиса, без позадинског процеса. Само фајлови у фолдеру. Желиш да погледаш унутра?"},
        {"character": "Ученик", "line": "Можемо једноставно... отворити?"},
        {"character": "Сократ", "line": "Наравно! Нема магије. HEAD је текстуални фајл — отвори га и видећеш на којој си грани. Свака грана у refs/heads/ је фајл који садржи 40-карактерни хеш. Фолдер objects/ чува сваку верзију сваког фајла који је икад комитован."},
        {"character": "Ученик", "line": "Значи кад смо рекли 'грана је само показивач'..."},
        {"character": "Сократ", "line": "Мислили смо то буквално. Фајл са хешом унутра. Обриши тај фајл и грана је нестала. Обриши цео .git фолдер и сва историја нестаје — мада твоји радни фајлови остају."},
        {"character": "Ученик", "line": "То је истовремено елегантно и застрашујуће."},
        {"character": "Сократ", "line": "Зато нам треба и .gitignore — фајл који каже Гиту шта да никад не прати. Артифакти градње, подешавања IDE-а, лог фајлови и изнад свега, тајне. .env фајл комитован на ГитХаб је видљив свакоме ко може да види репозиторијум."},
        {"character": "Ученик", "line": "Да ли треба да направим .gitignore пре свог првог комита?"},
        {"character": "Сократ", "line": "Увек. Накнадно игнорисање фајла који је већ праћен захтева додатни рад — 'git rm --cached'. Превенција је чистија од лека. Сада — прочитај HEAD фајл сам. Види својим очима оно што ти ГУИ никад није показао."}
      ]
    },
    "zen": {
      "title": "Отварање кутије",
      "dialogue": [
        {"character": "Мајстор", "line": "Користио си алат а да никад ниси погледао унутра. Данас отварамо кутију."},
        {"character": "Ученик", "line": "Коју кутију?"},
        {"character": "Мајстор", "line": "Фолдер .git. То је комплетан Гитов свет. Скривени директоријум унутар твог пројекта, који садржи сваки комит, сваку грану, сваки комадић историје који си икад креирао."},
        {"character": "Ученик", "line": "Рекли су ми да се никад не дирам тог фолдера."},
        {"character": "Мајстор", "line": "Никад га не мењај непромишљено. Али читање — тако долази разумевање. HEAD је текстуални фајл. Отвори га. Каже на којој си грани. Ништа више."},
        {"character": "Ученик", "line": "А саме гране?"},
        {"character": "Мајстор", "line": "Фајлови у refs/heads/. Сваки садржи четрдесет карактера — хеш комита. Рекао си да су гране деловале мистериозно. Сада видиш: оне су најједноставнија ствар у Гиту."},
        {"character": "Ученик", "line": "Шта је са objects фолдером?"},
        {"character": "Мајстор", "line": "Свака верзија сваког фајла, сачувана по хешу садржаја. Зато је Гит поуздан — исти садржај увек производи исти хеш, на било којој машини, у било које време. Истина кроз математику."},
        {"character": "Ученик", "line": "А .gitignore?"},
        {"character": "Мајстор", "line": "Не припада све историји. Артифакти градње су привремени. Подешавања IDE-а су лична. Тајне су опасне. Фајл .gitignore именује шта треба да остане споља. Направи га пре првог комита — уклонити нешто што је већ праћено је као покушати да поништиш звоно."},
        {"character": "Ученик", "line": "Желим да погледам унутра."},
        {"character": "Мајстор", "line": "Онда погледај. Прочитај HEAD. Погледај истину записану тамо у обичном тексту."}
      ]
    },
    "pair_programming": {
      "title": "Хајде да отворимо хаубу",
      "dialogue": [
        {"character": "Сам", "line": "Океј, Гит команде користиш већ неколико дана. Хоћеш да видиш нешто кул?"},
        {"character": "Алекс", "line": "Увек."},
        {"character": "Сам", "line": "Знаш .git фолдер у корену свог пројекта? Онај за који сви кажу 'не дирај'?"},
        {"character": "Алекс", "line": "Да, никад га нисам отворио."},
        {"character": "Сам", "line": "Хајде да га отворимо. Само су фајлови. HEAD је текстуални фајл — буквално садржи име твоје тренутне гране. То је све. Без магије."},
        {"character": "Алекс", "line": "Чекај, озбиљно? Само текстуални фајл?"},
        {"character": "Сам", "line": "Да. А гране? Фајлови у .git/refs/heads/. Сваки садржи 40-карактерни хеш који показује на комит. Сећаш се кад сам рекао да су гране само показивачи? Мислио сам БУКВАЛНО само показивачи. Фајл са хешом."},
        {"character": "Алекс", "line": "То је... много једноставније него што сам очекивао."},
        {"character": "Сам", "line": "То је цела Гитова фора — испод хаубе је елегантан. Фолдер objects чува сваку верзију сваког фајла, индексирану по хешу садржаја. Исти садржај увек даје исти хеш. Зато је Гит поуздан између машина."},
        {"character": "Алекс", "line": "Шта је са .gitignore? Увек заборавим да то подесим."},
        {"character": "Сам", "line": "Про савет: направи .gitignore ПРЕ првог комита. Стави артифакте градње, IDE фајлове, .env фајлове — све што не припада у репо. Ако заборавиш и комитујеш тајну, заувек је у историји. Морао би да препишеш историју да је уклониш."},
        {"character": "Алекс", "line": "Да, једном сам комитовао .env фајл са API кључевима. Мој вођа тима НИЈЕ био срећан."},
        {"character": "Сам", "line": "Ха, сви смо прошли кроз то. gitignore.io има готове шаблоне за сваки језик и IDE. Забележи га. Сад — иди прочитај HEAD фајл сам. Види шта је заправо унутра."}
      ]
    }
  }
}
