{
  "tutorial": "Гит из терминала",
  "technical_concept": "ГитХаб је једноставно хостована копија вашег .git фолдера са веб интерфејсом изграђеним изнад њега. Pull Request-ови, тикети и преглед кода су ГитХабове функције — Гит испод њих је идентичан ономе што радите локално. CI/CD (Континуална интеграција/Деплојмент) повезује аутоматизацију са вашим пушовањима: пушнете на main, пајплајн покрене тестове и аутоматски деплојује. Кад је пајплајн повезан, сваки 'git push' има стварне последице — зато су чисте Гит навике важне.",
  "challenge": {
    "task": "Ово је отворено истраживање. Укуцајте било коју гит команду коју сте научили — пробајте 'git log --oneline --graph --all', 'cat .git/HEAD', 'git status', 'git branch', или питајте било шта из овог водича.",
    "hint": "Пробајте команде из било које лекције. Ово је ваш сандбокс за слободно експериментисање.",
    "solution": "git log --oneline --graph --all"
  },
  "styles": {
    "socratic": {
      "title": "Изван твоје машине",
      "dialogue": [
        {"character": "Сократ", "line": "Истражили смо четири области, гране, поништавања и .git фолдер. Али до сада је све било локално. Кад пушујеш — куда иде?"},
        {"character": "Ученик", "line": "На ГитХаб."},
        {"character": "Сократ", "line": "А шта је ГитХаб, у смислу онога што смо научили?"},
        {"character": "Ученик", "line": "Удаљена... копија мог .git фолдера?"},
        {"character": "Сократ", "line": "Тачно тако! ГитХаб чува исте објекте, исте референце, исту историју. Све остало — Pull Request-ови, тикети, веб интерфејс — то су ГитХабови додаци. Гит испод је идентичан ономе што седи на твојој машини."},
        {"character": "Ученик", "line": "Значи 'origin' је само име за тај удаљени?"},
        {"character": "Сократ", "line": "Конвенција, ништа више. Сада — ту постаје последично. Многи тимови повезују аутоматизацију са својим репозиторијумима. Кад пушујеш на main, пајплајн детектује промену, покрене тестове и деплојује код. Аутоматски."},
        {"character": "Ученик", "line": "Значи мој 'git push' може да деплојује у продукцију?"},
        {"character": "Сократ", "line": "Може и често то ради. Ово се зове CI/CD — Континуална интеграција, Континуални деплојмент. Значи да сваки push има стварне последице. Површна порука комита постаје мистерија у логу деплоја. Покварен тест блокира цео тим."},
        {"character": "Ученик", "line": "Зато људи толико брину о чистим комитима и добрим порукама."},
        {"character": "Сократ", "line": "Сада разумеш комплетну слику. Мали, фокусирани комити. Смислене поруке. Feature гране за изолацију рада. Стабилан main. Ово нису педантна правила — то су практичне неопходности кад је аутоматизација укључена."},
        {"character": "Ученик", "line": "Осећам да сада заиста разумем Гит."},
        {"character": "Сократ", "line": "Увек си имао знање — само су ти требала права питања. Иди — слободно истражуј. Пробај било коју команду коју си научио. Терминал је твој."}
      ]
    },
    "zen": {
      "title": "Река стиже до мора",
      "dialogue": [
        {"character": "Мајстор", "line": "Све што смо вежбали било је унутар твоје машине. Река која тече у круговима. Данас стиже до мора."},
        {"character": "Ученик", "line": "Удаљени — ГитХаб."},
        {"character": "Мајстор", "line": "Да. А шта је ГитХаб, сада кад разумеш .git?"},
        {"character": "Ученик", "line": "Још једна копија истог .git фолдера, хостована на серверу."},
        {"character": "Мајстор", "line": "Добро. Pull Request-ови, тикети, веб интерфејс — то је лука изграђена око мора. Али вода сама је исти Гит који већ познајеш."},
        {"character": "Ученик", "line": "Шта се дешава после пушовања?"},
        {"character": "Мајстор", "line": "То зависи од тога шта ослушкује. Многи тимови повежу пајплајн са својим репозиторијумом. Push на main покреће ланац: тестови се покрену, пројекат се изгради, и ако је све у реду, код се деплојује. Аутоматски. Твој 'git push' постаје деплојмент."},
        {"character": "Ученик", "line": "То је моћно. И застрашујуће."},
        {"character": "Мајстор", "line": "Зато је дисциплина важна. Пиши јасне поруке комита — појављују се у логовима деплоја. Одржавај main стабилним. Користи feature гране. Прави мале, фокусиране комите које је лако разумети и лако поништити."},
        {"character": "Ученик", "line": "Ово нису само стилске преференце."},
        {"character": "Мајстор", "line": "Оне су последице система. Кад твој push покрене деплојмент, чистоћа постаје преживљавање. Ово путовање си почео не могавши да објасниш шта је грана. Сада знаш да је четрдесет-карактерни фајл. Познајеш четири области. Знаш како да поништиш са поверењем."},
        {"character": "Ученик", "line": "Гит је опет једноставан."},
        {"character": "Мајстор", "line": "Као што сам обећао. Иди сада — овај простор користи слободно. Пробај било коју команду. Терминал више није мистерија."}
      ]
    },
    "pair_programming": {
      "title": "Пушни на main, деплојуј у прод",
      "dialogue": [
        {"character": "Алекс", "line": "Значи све што смо радили је било локално. Кад долази ГитХаб на ред?"},
        {"character": "Сам", "line": "ГитХаб је само удаљени — хостована копија твог .git фолдера са фенси веб интерфејсом на врху. Кад пушујеш, твоји комити иду тамо. Pull Request-ови, тикети, преглед кода — то је све ГитХабов слој. Део са Гитом је идентичан."},
        {"character": "Алекс", "line": "Шта је са 'origin'? Видим то свуда."},
        {"character": "Сам", "line": "Само име. Кад клонираш репо, Гит аутоматски зове извор 'origin'. Конвенција. Могао би да га преименујеш у 'банана' и још увек би радило."},
        {"character": "Алекс", "line": "Ха. Океј, а CI/CD? Мој тим стално прича о пајплајновима."},
        {"character": "Сам", "line": "Једноставан концепт: пушнеш на main, ГитХаб то детектује, аутоматски покрене скрипту. Та скрипта покрене твоје тестове, изгради пројекат, и ако све прође — деплојује. Твој 'git push' буквално ставља код у продукцију."},
        {"character": "Алекс", "line": "То је одлично и застрашујуће."},
        {"character": "Сам", "line": "Што је тачно разлог зашто су све те Гит навике важне. Мали комити, јасне поруке, feature гране. Кад се нешто поквари у продукцији, мораш прочитати лог и схватити који комит је то урадио. 'поправи ствари' не помаже. 'Поправи валидацију пријаве за празне имејлове' помаже."},
        {"character": "Алекс", "line": "Почињем да капирам зашто је мој вођа тима тако стриктан око порука комита."},
        {"character": "Сам", "line": "Није до уредности — до тога је да можеш да дебагујеш у 2 ујутру кад продукција падне. Добра Гит хигијена је само то да ће ти будући ти бити захвалан."},
        {"character": "Алекс", "line": "Цео овај водич... мислим да сада заиста капирам Гит. Као, стварно."},
        {"character": "Сам", "line": "Увек си га знао — само ниси видео кроз ГУИ. Сада имаш ментални модел. Иди се играј по терминалу, пробај било коју команду. Поквари ствари. Тако се учи."}
      ]
    }
  }
}
