{
  "tutorial": "Osnove Redisa",
  "technical_concept": "Korištenje skupova (Sets) za pohranjivanje jedinstvenih zbirki i pronalaženje presjeka s naredbama SADD, SREM, SMEMBERS i SINTER.",
  "challenge": {
    "task": "Izgradite mreže poznanstava za osumnjičenika alpha i bravo. Alpha poznaje murphy, valdez i chen. Bravo poznaje murphy, jackson i chen. Pronađite zajedničke kontakte.",
    "hint": "Koristite SADD za izgradnju mreže svakog osumnjičenika, zatim SINTER za pronalaženje zajedničkih poznanstava."
  },
  "styles": {
    "detective_noir": {
      "title": "Mreža povezanosti",
      "dialogue": [
        {"character": "Detektiv Indecks", "line": "Imam dva osumnjičenika. Moram znati — koga poznaju obojica? Gdje se njihovi krugovi preklapaju?"},
        {"character": "REDIS", "line": "Za to su tu skupovi, detektive. Skup je zbirka gdje je svaki element jedinstven. SADD dodaje člana. Bez duplikata — ako već postoji, jednostavno ga ignorira."},
        {"character": "Detektiv Indecks", "line": "Dakle gradim mrežu kontakata za svakog osumnjičenika posebno?"},
        {"character": "REDIS", "line": "Točno. SADD contacts:alpha murphy valdez chen. SADD contacts:bravo murphy jackson chen. Zatim SINTER contacts:alpha contacts:bravo — i dobijete imena koja su u OBA skupa."},
        {"character": "Detektiv Indecks", "line": "Presjek. Zajednički kontakti. To su moji glavni osumnjičenici."},
        {"character": "REDIS", "line": "Upravo tako. SMEMBERS vam pokazuje cijeli skup. SINTER pronalazi preklapanja. Kao Vennov dijagram, ali brži."},
        {"character": "Detektiv Indecks", "line": "Vrijeme za izgradnju tih mreža i pronalaženje veza."}
      ]
    },
    "sci_fi": {
      "title": "Analiza pristupnih mreža",
      "dialogue": [
        {"character": "NEXUS", "line": "Inženjeru, otkrivena su dva neovlaštena pristupa. Moramo analizirati njihove pristupne obrasce i pronaći preklapanja."},
        {"character": "Inženir", "line": "Moram znati kojim su sustavima pristupili obojica. Presjek."},
        {"character": "NEXUS", "line": "Redis skupovi su dizajnirani za upravo to. SADD dodaje elemente u skup — automatski jedinstvene. Zatim SINTER pronalazi elemente koji postoje u oba skupa."},
        {"character": "Inženir", "line": "Dakle gradim pristupni skup za svakog korisnika?"},
        {"character": "NEXUS", "line": "Točno. SMEMBERS prikazuje sve članove skupa. SINTER izračunava presjek u milisekundama, bez obzira na veličinu."},
        {"character": "Inženir", "line": "Učinkovita analiza. Izgradimo te pristupne skupove."},
        {"character": "NEXUS", "line": "Spreman za podatke, inženjeru."}
      ]
    }
  }
}
