{
  "tutorial": "Osnove SQL-a",
  "technical_concept": "Korištenje INNER JOIN za kombiniranje podataka iz više povezanih tablica.",
  "challenge": {
    "task": "Povežite zaposlenike s imenima njihovih odjela. Spojite tablicu employees s tablicom departments da vidite tko radi gdje.",
    "hint": "Koristite INNER JOIN s ON za povezivanje employees.department_id s departments.id."
  },
  "styles": {
    "detective_noir": {
      "title": "Povezivanje točaka",
      "dialogue": [
        {"character": "Detektiv Indecks", "line": "Imam imena zaposlenika i ID-jeve odjela, ali ID-jevi mi ne znače ništa. Trebam stvarna imena odjela."},
        {"character": "Podatkovna baza", "line": "Te informacije su u dvjema zasebnim tablicama, detektive. Zaposlenici u jednoj, podaci o odjelima u drugoj. Trebate JOIN — spajanje."},
        {"character": "Detektiv Indecks", "line": "Spajanje? Kako to funkcionira?"},
        {"character": "Podatkovna baza", "line": "INNER JOIN povezuje tablice koristeći zajednički ključ. Ovdje se `employees.department_id` poklapa s `departments.id`. Rezultat prikazuje ime zaposlenika ZAJEDNO s imenom odjela."},
        {"character": "Detektiv Indecks", "line": "Dakle to je kao unakrsno provjeravanje dosjea? Jedan dosje ima imena, drugi ima podatke o odjelima, i povežeš ih?"},
        {"character": "Podatkovna baza", "line": "Točno. INNER JOIN prikazuje samo retke gdje postoji poklapanje u obje tablice. Ako zaposlenik nema odjel, neće se prikazati."},
        {"character": "Detektiv Indecks", "line": "Razumijem. Spojimo te tablice i pogledajmo cjelokupnu sliku."}
      ]
    },
    "sci_fi": {
      "title": "Relacijsko povezivanje podataka",
      "dialogue": [
        {"character": "Inženir", "line": "NEXUS, imam kadrovske zapise s ID-jevima odjela, ali trebam stvarna imena odjela pored imena osoblja."},
        {"character": "NEXUS", "line": "To je relacijska podatkovna struktura, inženjeru. Informacije o odjelima su u zasebnoj tablici. Za kombiniranje trebate operaciju JOIN."},
        {"character": "Inženir", "line": "Objasni mehanizam spajanja."},
        {"character": "NEXUS", "line": "INNER JOIN kombinira retke iz dviju tablica gdje je ispunjen određeni uvjet. Primjer: SELECT e.first_name, d.name FROM employees e INNER JOIN departments d ON e.department_id = d.id."},
        {"character": "Inženir", "line": "Dakle to je kao spajanje dvaju skupova podataka na temelju zajedničkog identifikatora?"},
        {"character": "NEXUS", "line": "Točno. INNER JOIN vraća samo retke s poklapajućim vrijednostima u obje tablice. Nepoklapajući zapisi su isključeni."},
        {"character": "Inženir", "line": "Razumljeno. Izvršimo operaciju spajanja."}
      ]
    }
  }
}
