{
  "tutorial": "Основе SQL",
  "technical_concept": "Увод у SQL и истраживање структуре базе података.",
  "challenge": {
    "task": "Повежите се са базом података и излистајте све доступне табеле да бисте разумели структуру података.",
    "hint": "Упитајте табелу sqlite_master да видите које табеле постоје у овој бази."
  },
  "styles": {
    "detective_noir": {
      "title": "Корпоративни досијеи",
      "dialogue": [
        {"character": "Детектив Индекс", "line": "Још једна касна ноћ. Још један случај. Овог пута корпоративна превара у TechCorpu. Време да зароним у записе."},
        {"character": "База података", "line": "Добродошли, детективе. Ја сам база података компаније — SQLite. Чувам све записе: запослене, одељења, пројекте и задужења."},
        {"character": "Детектив Индекс", "line": "SQLite, а? Нисам раније радио с тобом. Како да знам шта имаш?"},
        {"character": "База података", "line": "Једноставно. Свака база података има главни каталог. Упитајте `sqlite_master` са SELECT name, type FROM sqlite_master WHERE type='table' — и добићете листу свих табела."},
        {"character": "Детектив Индекс", "line": "Значи табеле су као картотечни ормари? Сваки чува различите врсте записа?"},
        {"character": "База података", "line": "Тачно. Ова база има четири табеле: departments, employees, projects и employee_projects. Свака прича други део приче."},
        {"character": "Детектив Индекс", "line": "У реду, хајде да видимо с чиме располажемо. Покажи ми те табеле."}
      ]
    },
    "sci_fi": {
      "title": "Приступ систему базе података",
      "dialogue": [
        {"character": "Инжењер", "line": "НЕКСУС, потребан ми је приступ кадровској бази података станице. Који систем користимо?"},
        {"character": "НЕКСУС", "line": "База података станице ради на SQLite, инжењеру. Садржи све кадровске, одељенске, пројектне и записе задужења."},
        {"character": "Инжењер", "line": "Како да видим које структуре података су доступне?"},
        {"character": "НЕКСУС", "line": "Свака SQLite база одржава системски каталог звани sqlite_master. Извршите: SELECT name, type FROM sqlite_master WHERE type='table' за листу свих ентитета података."},
        {"character": "Инжењер", "line": "Табеле су примарни контејнери за складиштење података?"},
        {"character": "НЕКСУС", "line": "Тачно. Свака табела представља засебан тип ентитета. Ова база садржи четири табеле: departments, employees, projects и employee_projects."},
        {"character": "Инжењер", "line": "Разумео. Проверимо интегритет базе листањем табела."}
      ]
    }
  }
}
