{
  "tutorial": "Основе SQL",
  "technical_concept": "Коришћење INNER JOIN за комбиновање података из више повезаних табела.",
  "challenge": {
    "task": "Повежите запослене са именима њихових одељења. Спојите табелу employees са табелом departments да видите ко ради где.",
    "hint": "Користите INNER JOIN са ON за повезивање employees.department_id са departments.id."
  },
  "styles": {
    "detective_noir": {
      "title": "Повезивање тачака",
      "dialogue": [
        {"character": "Детектив Индекс", "line": "Имам имена запослених и ID-ове одељења, али ID-ови ми не значе ништа. Требају ми стварна имена одељења."},
        {"character": "База података", "line": "Те информације су у две одвојене табеле, детективе. Запослени у једној, подаци о одељењима у другој. Потребан вам је JOIN — спајање."},
        {"character": "Детектив Индекс", "line": "Спајање? Како то ради?"},
        {"character": "База података", "line": "INNER JOIN повезује табеле користећи заједнички кључ. Овде се `employees.department_id` поклапа са `departments.id`. Резултат приказује име запосленог ЗАЈЕДНО са именом одељења."},
        {"character": "Детектив Индекс", "line": "Значи то је као укрштена провера досијеа? Један досије има имена, други има податке о одељењима, и повезујеш их?"},
        {"character": "База података", "line": "Тачно. INNER JOIN приказује само редове где постоји поклапање у обе табеле. Ако запослени нема одељење, неће се појавити."},
        {"character": "Детектив Индекс", "line": "Разумем. Хајде да спојимо ове табеле и видимо целу слику."}
      ]
    },
    "sci_fi": {
      "title": "Релационо повезивање података",
      "dialogue": [
        {"character": "Инжењер", "line": "НЕКСУС, имам кадровске записе са ID-овима одељења, али требају ми стварна имена одељења уз имена особља."},
        {"character": "НЕКСУС", "line": "То је релациона структура података, инжењеру. Информације о одељењима су у одвојеној табели. За комбиновање потребна вам је JOIN операција."},
        {"character": "Инжењер", "line": "Објасни механизам спајања."},
        {"character": "НЕКСУС", "line": "INNER JOIN комбинује редове из две табеле где је испуњен одређени услов. Пример: SELECT e.first_name, d.name FROM employees e INNER JOIN departments d ON e.department_id = d.id."},
        {"character": "Инжењер", "line": "Значи то је као спајање два скупа података на основу заједничког идентификатора?"},
        {"character": "НЕКСУС", "line": "Тачно. INNER JOIN враћа само редове са поклапајућим вредностима у обе табеле. Неподударни записи су искључени."},
        {"character": "Инжењер", "line": "Разумео. Извршимо операцију спајања."}
      ]
    }
  }
}
