{
  "tutorial": "Redis Basics",
  "module": 1,
  "scene": 1,
  "technical_concept": "Using Strings for basic key-value storage with SET, GET, and SETEX for expiry.",
  "code_example": {
    "language": "redis-cli",
    "code": "SETEX online:user789 300 \"active\""
  },
  "challenge": {
    "task": "A new person of interest, `user456`, just came online. Mark their status as 'online' but make sure the lead goes cold (expires) in exactly 2 minutes (120 seconds).",
    "hint": "SETEX lets you set a key with an expiry in one command. The syntax is SETEX key seconds value.",
    "check_logic": {
      "validation_command": "TTL online:user456",
      "expected_result": {
        "type": "integer_greater_than",
        "value": 110
      }
    },
    "solution": "SETEX online:user456 120 online"
  },
  "styles": [
    {
      "name": "detective_noir",
      "title": "The Ephemeral Lead",
      "dialogue": [
        {
          "character": "Detective Indecks",
          "line": "Indecks."
        },
        {
          "character": "REDIS",
          "line": "Got a new lead for you, detective. A shadowy figure, `user789`. We need to track them, but only when they're active. We can't waste resources tailing them when they go dark."
        },
        {
          "character": "Detective Indecks",
          "line": "So I need a way to put a temporary tag on them. What's the tool?"
        },
        {
          "character": "REDIS",
          "line": "The simplest tool in the box. A basic key-value pair. You give me a key, like `online:user789`, and a value, like 'active'. My `SET` command handles it. If you need to check the status, you just ask me with `GET online:user789`."
        },
        {
          "character": "Detective Indecks",
          "line": "But you said temporary. What if I forget to remove the tag? The lead goes cold, but my board still says they're active. Sloppy work."
        },
        {
          "character": "REDIS",
          "line": "That's why you don't use `SET`. You use `SETEX`—SET with Expiry. You give me the key, the number of seconds to keep the lead alive, and the value. For example: `SETEX online:user789 300 \"active\"`. In 5 minutes (300 seconds), that record vanishes. No loose ends. No sloppy work."
        },
        {
          "character": "Detective Indecks",
          "line": "Clean. I like it. Let's put it to the test."
        }
      ]
    },
    {
      "name": "sci_fi",
      "title": "Temporal Data Markers",
      "dialogue": [
        {
          "character": "NEXUS",
          "line": "Engineer, incoming transmission. Crew member designation CR-789 has just logged into the main terminal."
        },
        {
          "character": "Engineer",
          "line": "I need to track their online status, but only while they're actively connected. Can't waste memory on stale session data."
        },
        {
          "character": "NEXUS",
          "line": "Understood. We use key-value pairs for efficient tracking. I can store a key like 'session:CR-789' with a value of 'active'. To check their status later, simply query with GET."
        },
        {
          "character": "Engineer",
          "line": "But what about when they disconnect? I can't manually purge every session marker."
        },
        {
          "character": "NEXUS",
          "line": "That's why we use SETEX - SET with EXpiry. Specify the key, duration in seconds, and value. Example: SETEX session:CR-789 300 'active'. After 300 seconds, the data automatically purges. Zero maintenance overhead."
        },
        {
          "character": "Engineer",
          "line": "Efficient. I like it. Let's test this auto-cleanup system."
        },
        {
          "character": "NEXUS",
          "line": "Ready to receive your command, Engineer."
        }
      ]
    },
    {
      "name": "shakespearean",
      "title": "Of Fleeting Marks and Temporal Tags",
      "dialogue": [
        {
          "character": "Lord Cachington",
          "line": "REDIS, a visitor approaches—User456, a most suspicious character! I must mark their presence, yet only whilst they tarry."
        },
        {
          "character": "REDIS",
          "line": "Ah, my lord seeks the art of the ephemeral notation! For this, we employ the humble String—a key paired with its value, as lovers in the moonlight."
        },
        {
          "character": "Lord Cachington",
          "line": "But what if mine memory fails me? What if I forget to strike their name when they depart? Such negligence would shame mine house!"
        },
        {
          "character": "REDIS",
          "line": "Fear not! For I possess SETEX—'tis SET with EXpiry most wondrous! Thou givest me the key 'online:user456', the seconds it shall live, and its value. Example: SETEX online:user456 120 'online'. In two minutes' time—120 heartbeats—the record shall vanish like morning dew!"
        },
        {
          "character": "Lord Cachington",
          "line": "A self-cleaning ledger! 'Tis sorcery most practical!"
        },
        {
          "character": "REDIS",
          "line": "No sorcery, my lord—merely the passage of time made useful. The data expires as naturally as the setting sun."
        },
        {
          "character": "Lord Cachington",
          "line": "Then let us inscribe this temporary mark and watch time claim it back!"
        }
      ]
    },
    {
      "name": "office_comedy",
      "title": "Session Tracking Meeting",
      "dialogue": [
        {
          "character": "Dave (IT Manager)",
          "line": "Okay team, we need to track user sessions. When someone logs in, we mark them as 'online'. When they log out, we clear the marker. Simple, right?"
        },
        {
          "character": "New Hire",
          "line": "What if they don't log out properly? Like, what if they just close the browser?"
        },
        {
          "character": "Dave (IT Manager)",
          "line": "Then we have ghost sessions clogging up the system forever. It's like leaving yogurt in the break room fridge—eventually someone has to clean it up."
        },
        {
          "character": "REDIS",
          "line": "That's why I have SETEX. SET with EXpiry. You set a key with a timeout. After those seconds elapse, I automatically delete it. Zero manual cleanup required."
        },
        {
          "character": "New Hire",
          "line": "So I just... tell you how long to remember something?"
        },
        {
          "character": "REDIS",
          "line": "Exactly. SETEX online:user456 120 'online' means: Remember that user456 is online, but only for 120 seconds. After that, forget about them completely."
        },
        {
          "character": "Dave (IT Manager)",
          "line": "It's like setting a timer on the microwave, except instead of reheating burrito, you're managing session state."
        },
        {
          "character": "New Hire",
          "line": "That's... actually pretty elegant."
        },
        {
          "character": "REDIS",
          "line": "I like to think so. Now let's track user456 with a 2-minute expiration and prove this works."
        }
      ]
    }
  ]
}