{
  "tutorial": "Redis Basics",
  "module": 1,
  "scene": 3,
  "technical_concept": "Using Sets to store unique collections and find intersections with SADD, SREM, SISMEMBER, and SINTER.",
  "code_example": {
    "language": "redis-cli",
    "code": "SADD known_associates:alpha \"murphy\" \"valdez\" \"chen\"\nSADD known_associates:bravo \"murphy\" \"torres\" \"kim\"\nSINTER known_associates:alpha known_associates:bravo"
  },
  "challenge": {
    "task": "Build associate networks for suspects alpha and bravo. Alpha knows murphy, valdez, and chen. Bravo knows murphy, torres, and kim. Find their common connections.",
    "hint": "Use SADD to build each suspect's network, then SINTER to find who they both know.",
    "check_logic": {
      "validation_command": "SINTER known_associates:alpha known_associates:bravo",
      "expected_result": {
        "type": "set_contains",
        "value": "murphy"
      }
    }
  },
  "styles": [
    {
      "name": "detective_noir",
      "title": "The Connection Web",
      "dialogue": [
        {
          "character": "Detective Indecks",
          "line": "Two suspects, dozens of known associates. There's got to be a connection—someone who knows them both. That's my smoking gun."
        },
        {
          "character": "REDIS",
          "line": "Sounds like you need Sets, detective. Perfect for tracking unique relationships and finding overlaps. No duplicates, no confusion—just clean connections."
        },
        {
          "character": "Detective Indecks",
          "line": "How do I map out their networks?"
        },
        {
          "character": "REDIS",
          "line": "Use `SADD` to build each suspect's associate network. For example: `SADD known_associates:alpha \"murphy\"` adds Murphy to Alpha's network. Add as many as you need—Sets automatically handle uniqueness."
        },
        {
          "character": "Detective Indecks",
          "line": "And to find the connection between them?"
        },
        {
          "character": "REDIS",
          "line": "`SINTER known_associates:alpha known_associates:bravo` gives you the intersection—everyone who appears in both networks. Your common connections, your potential witnesses."
        },
        {
          "character": "Detective Indecks",
          "line": "What about checking if someone specific is in a network?"
        },
        {
          "character": "REDIS",
          "line": "`SISMEMBER known_associates:alpha \"murphy\"` returns 1 if Murphy knows Alpha, 0 if not. Quick membership checks. And `SREM` removes someone from a network if they turn out to be a dead end."
        },
        {
          "character": "Detective Indecks",
          "line": "Beautiful. Time to map these connections and find my link."
        }
      ]
    },
    {
      "name": "sci_fi",
      "title": "Access Network Analysis",
      "dialogue": [
        {
          "character": "Engineer",
          "line": "NEXUS, we have two security clearance groups. I need to identify personnel who have access to both restricted zones."
        },
        {
          "character": "NEXUS",
          "line": "This requires Set operations, Engineer. Sets are ideal for managing unique collections and computing intersections—no duplicates, mathematically precise."
        },
        {
          "character": "Engineer",
          "line": "How do I define each access group?"
        },
        {
          "character": "NEXUS",
          "line": "Use SADD to populate each set. Example: SADD clearance:zone_alpha 'officer_murphy' adds Murphy to Zone Alpha's access list. Sets automatically enforce uniqueness—adding the same member twice has no effect."
        },
        {
          "character": "Engineer",
          "line": "And to find personnel with dual clearance?"
        },
        {
          "character": "NEXUS",
          "line": "SINTER clearance:zone_alpha clearance:zone_bravo computes the set intersection—all members present in both groups. These are your dual-clearance personnel."
        },
        {
          "character": "Engineer",
          "line": "Can I verify individual clearance status?"
        },
        {
          "character": "NEXUS",
          "line": "SISMEMBER clearance:zone_alpha 'officer_murphy' returns 1 if Murphy has access, 0 otherwise. For revoking access, use SREM to remove members from the set."
        },
        {
          "character": "Engineer",
          "line": "Precise and efficient. Let's map these access networks."
        }
      ]
    },
    {
      "name": "shakespearean",
      "title": "The Web of Conspirators",
      "dialogue": [
        {
          "character": "Lord Cachington",
          "line": "Two suspects, yet a web of associates most tangled! Alpha knows Murphy, Valdez, and Chen. Bravo knows Murphy, Torres, and Kim. Who is the common thread in this conspiracy?"
        },
        {
          "character": "REDIS",
          "line": "Ah, my lord seeks the intersection of two circles! For this, we employ Sets—collections most unique, where each soul appears but once."
        },
        {
          "character": "Lord Cachington",
          "line": "How dost thou construct such webs of connection?"
        },
        {
          "character": "REDIS",
          "line": "Use SADD to inscribe each associate! SADD known_associates:alpha 'murphy' records Murphy in Alpha's circle. Add Valdez and Chen likewise. Then do the same for Bravo's confederates."
        },
        {
          "character": "Lord Cachington",
          "line": "And to find who dwells in both circles—the link between these rogues?"
        },
        {
          "character": "REDIS",
          "line": "SINTER known_associates:alpha known_associates:bravo reveals the intersection! All souls who appear in BOTH sets—thy smoking gun, thy witness most valuable!"
        },
        {
          "character": "Lord Cachington",
          "line": "What if I must verify whether Murphy truly knows Alpha?"
        },
        {
          "character": "REDIS",
          "line": "SISMEMBER known_associates:alpha 'murphy' returns 1 for truth, 0 for falsehood. Swift verification, like asking 'Art thou guilty?' and receiving a simple yea or nay!"
        },
        {
          "character": "Lord Cachington",
          "line": "Brilliant! Let us map these conspirators and unmask their common ally!"
        }
      ]
    },
    {
      "name": "office_comedy",
      "title": "The Slack Channel Overlap Report",
      "dialogue": [
        {
          "character": "Dave (IT Manager)",
          "line": "Corporate wants to know which employees are in both the #engineering channel AND the #management channel. Apparently they're 'potential leadership candidates.' Or flight risks. Hard to tell with HR."
        },
        {
          "character": "New Hire",
          "line": "How do I find people who are in multiple channels?"
        },
        {
          "character": "REDIS",
          "line": "Sets are perfect for this. Add members to each channel using SADD, then use SINTER to find the overlap. It's like a Venn diagram, but actually useful."
        },
        {
          "character": "Dave (IT Manager)",
          "line": "SADD channel:engineering 'murphy' 'valdez' 'chen'. SADD channel:management 'murphy' 'torres' 'kim'. Then SINTER shows you who's in both."
        },
        {
          "character": "New Hire",
          "line": "Why not just use a spreadsheet?"
        },
        {
          "character": "REDIS",
          "line": "Because Sets automatically handle uniqueness. You can add Murphy five times and I'll only store him once. Try that with Excel—you'll spend three hours filtering duplicates."
        },
        {
          "character": "Dave (IT Manager)",
          "line": "Also, SISMEMBER lets you quickly check if someone's in a set. Like checking if Karen from Accounting is in the #complaints channel. Spoiler: she is."
        },
        {
          "character": "New Hire",
          "line": "Can I remove someone from a set?"
        },
        {
          "character": "REDIS",
          "line": "SREM. Sarah left the company? SREM channel:engineering 'sarah'. She's gone from the set, but the rest remain untouched."
        },
        {
          "character": "Dave (IT Manager)",
          "line": "Alright, let's build these channel membership sets and find our overlap candidates before HR sends another reminder email."
        }
      ]
    }
  ]
}