{
  "tutorial": "Основе Redis",
  "technical_concept": "Увод у Redis и припрема детективског алата.",
  "challenge": {
    "task": "Повежите се са Редисом и проверите да ли ради слањем PING команде.",
    "hint": "Користите PING команду да проверите да ли је Redis активан."
  },
  "styles": {
    "detective_noir": {
      "title": "Детектив за податке",
      "dialogue": [
        {"character": "Приповедач", "line": "Киша је ударала по прозорима старе канцеларијске зграде у 42. улици. Унутра је фигура седела погнута над светлећим терминалом."},
        {"character": "Детектив Индекс", "line": "Још једна ноћ, још један случај. Град никад не спава, а ни подаци."},
        {"character": "REDIS", "line": "Добро вече, детективе. Очекивао сам вас. Зовем се REDIS — Remote Dictionary Server. Ја сам ваш нови партнер на овом терену."},
        {"character": "Детектив Индекс", "line": "Партнер? Ја радим сам."},
        {"character": "REDIS", "line": "Више не. Злочини над подацима у овом граду постају све сложенији. Потребан вам је неко ко може брзо да сачува доказе, још брже да их пронађе и никад не заборави траг. Ту ступам ја на сцену."},
        {"character": "Детектив Индекс", "line": "Докажи. Покажи ми да си жив и спреман."},
        {"character": "REDIS", "line": "Једноставно. Пошаљите ми PING, а ја ћу вам вратити PONG. Тако успостављамо поверење у овом послу."}
      ]
    },
    "sci_fi": {
      "title": "Иницијализација система",
      "dialogue": [
        {"character": "Станични ВИ", "line": "Добродошли на Орбиталну станицу Нексус-7. Ја сам НЕКСУС, централни ВИ помоћник ваше станице."},
        {"character": "Инжењер", "line": "НЕКСУС, извештај о стању. Морам да проверим да ли сви системи раде."},
        {"character": "НЕКСУС", "line": "Наравно, инжењеру. Користим брзи систем за складиштење података звани REDIS — Remote Dictionary Server. Управља свим подацима станице са временом одзива у милисекундама."},
        {"character": "Инжењер", "line": "REDIS? Никад чуо. Како знам да ради исправно?"},
        {"character": "НЕКСУС", "line": "Најједноставнија дијагностика је протокол руковања. Пошаљите ми PING команду и одговорићу са PONG. То потврђује да је језгро података активно и одзивно."},
        {"character": "Инжењер", "line": "У реду, НЕКСУС. Хајде да проверимо да ли је овај систем спреман за рад."},
        {"character": "НЕКСУС", "line": "Чекам вашу команду, инжењеру."}
      ]
    }
  }
}
