{
  "tutorial": "Основе Redis",
  "technical_concept": "Коришћење стрингова за основно складиштење кључ-вредност са командама SET, GET и SETEX за истек важности.",
  "challenge": {
    "task": "Нова особа од интереса, `user456`, управо је дошла на мрежу. Означите њен статус као 'online' али обезбедите да траг нестане (истекне) за тачно 2 минута (120 секунди).",
    "hint": "Потребна вам је команда која поставља кључ са временом истека у једној операцији."
  },
  "styles": {
    "detective_noir": {
      "title": "Пролазни траг",
      "dialogue": [
        {"character": "Детектив Индекс", "line": "Индекс."},
        {"character": "REDIS", "line": "Имам нови траг за вас, детективе. Сумњива фигура, `user789`. Морамо да је пратимо, али само кад је активна. Не можемо да трошимо ресурсе кад нестане."},
        {"character": "Детектив Индекс", "line": "Значи треба ми начин да јој ставим привремену ознаку. Који алат?"},
        {"character": "REDIS", "line": "Најједноставнији алат. Основни пар кључ-вредност. Дате ми кључ, као `online:user789`, и вредност, као 'active'. Моја `SET` команда то решава. Ако желите да проверите статус, питате ме са `GET online:user789`."},
        {"character": "Детектив Индекс", "line": "Али рекли сте привремено. Шта ако заборавим да уклоним ознаку? Траг нестане, а моја табла још увек каже да је активна. Неуредан посао."},
        {"character": "REDIS", "line": "Зато не користите `SET`. Користите `SETEX` — SET са истеком. Дате ми кључ, број секунди и вредност. На пример: `SETEX online:user789 300 \"active\"`. За 5 минута (300 секунди) тај запис нестаје. Без отворених крајева."},
        {"character": "Детектив Индекс", "line": "Чисто. Свиђа ми се. Хајде да тестирамо."}
      ]
    },
    "sci_fi": {
      "title": "Временски маркери података",
      "dialogue": [
        {"character": "НЕКСУС", "line": "Инжењеру, долазна трансмисија. Члан посаде са ознаком CR-789 се управо пријавио на главни терминал."},
        {"character": "Инжењер", "line": "Морам да пратим њихов статус, али само док су активно повезани. Не могу да трошим меморију на застареле податке сесије."},
        {"character": "НЕКСУС", "line": "Разумео. Користимо парове кључ-вредност за ефикасно праћење. Могу да сачувам кључ као 'session:CR-789' са вредношћу 'active'. За каснију проверу једноставно упитајте са GET."},
        {"character": "Инжењер", "line": "А шта кад се одјаве? Не могу ручно да чистим сваки маркер сесије."},
        {"character": "НЕКСУС", "line": "Зато користимо SETEX — SET са истеком. Одредите кључ, трајање у секундама и вредност. Пример: SETEX session:CR-789 300 'active'. После 300 секунди подаци се аутоматски бришу. Без одржавања."},
        {"character": "Инжењер", "line": "Ефикасно. Свиђа ми се. Тестирајмо овај систем аутоматског чишћења."},
        {"character": "НЕКСУС", "line": "Чекам вашу команду, инжењеру."}
      ]
    }
  }
}
