{
  "tutorial": "Основе Redis",
  "technical_concept": "Коришћење листа за управљање уређеним колекцијама са командама LPUSH, RPUSH, LPOP и RPOP за редове чекања и низове.",
  "challenge": {
    "task": "Три осумњичена су управо стигла: `suspect_alpha`, `suspect_bravo` и `suspect_charlie`. Додајте их у ред за саслушање, а затим позовите првог на саслушање.",
    "hint": "Користите RPUSH да додате осумњичене на крај реда, затим LPOP да позовете првог на саслушање."
  },
  "styles": {
    "detective_noir": {
      "title": "Ред за саслушање",
      "dialogue": [
        {"character": "Детектив Индекс", "line": "Имам три осумњичена у чекаоници. Потребан ми је систем — ко је стигао први, иде први на саслушање."},
        {"character": "REDIS", "line": "За то су ту листе, детективе. Замислите ред чекања. RPUSH додаје некога на крај. LPUSH га ставља на почетак — за приоритетне случајеве."},
        {"character": "Детектив Индекс", "line": "А кад сам спреман за саслушање?"},
        {"character": "REDIS", "line": "LPOP узима првог из реда. RPOP узима последњег. Као ред у пекари — први дође, први буде услужен. Или обрнуто, ако имате разлог."},
        {"character": "Детектив Индекс", "line": "Уредан систем. Нема забуне, нема прескакања."},
        {"character": "REDIS", "line": "Тачно. А са LRANGE можете у сваком тренутку да погледате цео ред, а да никог не уклоните. Као поглед кроз једносмерно стакло."},
        {"character": "Детектив Индекс", "line": "Хајде да поставимо овај ред за саслушање."}
      ]
    },
    "sci_fi": {
      "title": "Приоритетни ред за обраду",
      "dialogue": [
        {"character": "НЕКСУС", "line": "Инжењеру, три дијагностичка процеса чекају на извршење. Потребан нам је уређен ред чекања."},
        {"character": "Инжењер", "line": "Морам да их обрадим по реду. Први унутра, први напоље."},
        {"character": "НЕКСУС", "line": "Redis листе су идеалне за ово. RPUSH додаје у ред, LPOP узима следећег за обраду. Савршена FIFO структура — први унутра, први напоље."},
        {"character": "Инжењер", "line": "А шта ако морам хитан процес да ставим на врх?"},
        {"character": "НЕКСУС", "line": "Користите LPUSH — убацује на почетак уместо на крај. Приоритетни процеси иду напред. LRANGE вам показује цео ред у сваком тренутку."},
        {"character": "Инжењер", "line": "Флексибилно. Поставимо ред и почнимо са обрадом."},
        {"character": "НЕКСУС", "line": "Чекам ваше команде, инжењеру."}
      ]
    }
  }
}
