{
  "tutorial": "Основе Redis",
  "technical_concept": "Коришћење скупова (Sets) за складиштење јединствених колекција и проналажење пресека са командама SADD, SREM, SMEMBERS и SINTER.",
  "challenge": {
    "task": "Изградите мреже познанстава за осумњичене alpha и bravo. Alpha познаје murphy, valdez и chen. Bravo познаје murphy, jackson и chen. Пронађите заједничке контакте.",
    "hint": "Користите SADD за изградњу мреже сваког осумњиченог, затим SINTER за проналажење заједничких познанстава."
  },
  "styles": {
    "detective_noir": {
      "title": "Мрежа веза",
      "dialogue": [
        {"character": "Детектив Индекс", "line": "Имам два осумњичена. Морам да знам — кога обојица познају? Где се њихови кругови преклапају?"},
        {"character": "REDIS", "line": "За то су ту скупови, детективе. Скуп је колекција где је сваки елемент јединствен. SADD додаје члана. Без дупликата — ако већ постоји, једноставно га игнорише."},
        {"character": "Детектив Индекс", "line": "Значи градим мрежу контаката за сваког осумњиченог посебно?"},
        {"character": "REDIS", "line": "Тачно. SADD contacts:alpha murphy valdez chen. SADD contacts:bravo murphy jackson chen. Затим SINTER contacts:alpha contacts:bravo — и добијате имена која су у ОБА скупа."},
        {"character": "Детектив Индекс", "line": "Пресек. Заједнички контакти. То су моји главни осумњичени."},
        {"character": "REDIS", "line": "Управо тако. SMEMBERS вам показује цео скуп. SINTER проналази преклапања. Као Венов дијаграм, али бржи."},
        {"character": "Детектив Индекс", "line": "Време за изградњу тих мрежа и проналажење веза."}
      ]
    },
    "sci_fi": {
      "title": "Анализа приступних мрежа",
      "dialogue": [
        {"character": "НЕКСУС", "line": "Инжењеру, детектована су два неовлашћена приступа. Морамо да анализирамо њихове обрасце приступа и пронађемо преклапања."},
        {"character": "Инжењер", "line": "Морам да знам којим системима су обојица приступали. Пресек."},
        {"character": "НЕКСУС", "line": "Redis скупови су дизајнирани управо за ово. SADD додаје елементе у скуп — аутоматски јединствене. Затим SINTER проналази елементе који постоје у оба скупа."},
        {"character": "Инжењер", "line": "Значи градим приступни скуп за сваког корисника?"},
        {"character": "НЕКСУС", "line": "Тачно. SMEMBERS приказује све чланове скупа. SINTER израчунава пресек у милисекундама, без обзира на величину."},
        {"character": "Инжењер", "line": "Ефикасна анализа. Хајде да изградимо те приступне скупове."},
        {"character": "НЕКСУС", "line": "Спреман за податке, инжењеру."}
      ]
    }
  }
}
